[
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": 4,
    "author": "lulutchitchi",
    "hotelId": "601762",
    "reviewId": "601762:36",
    "ratingLocation": 4,
    "ratingCleanliness": 5,
    "ratingService": 4,
    "ratingBusiness": 4,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "OTHER": "p",
        "SERVICE": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "LOCATION": "p"
      },
      {
        "OTHER": "p"
      }
    ],
    "date": "Jul 7, 2008",
    "ratingCheckin": 5,
    "segments": [
      "swiss experience in nyc great stay in nyc thanks to blue moon hotel with its very friendly staff.",
      "fine rooms, very quiet.",
      "excellent location in downtown.",
      "highly recommandable"
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": 4,
    "author": "cosmokazi",
    "hotelId": "100570",
    "reviewId": "100570:1",
    "ratingLocation": 5,
    "ratingCleanliness": 4,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": 3,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "BUILDING": "in",
        "OTHER": "p"
      },
      {
        "LOCATION": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "OTHER": "n"
      },
      {
        "OTHER": "n"
      }
    ],
    "date": "Dec 2, 2008",
    "ratingCheckin": 5,
    "segments": [
      "Good Hotel, Minor Complaint",
      "Hotel was nice, yes, maybe it needs updating, but it was fine nonetheless.",
      "It is indeed close to everything, Shopping Malls and Pike's Place Market.",
      "Hotel staff was friendly and helpful.",
      "The only complaint I have is the charge for parking- $35.00 for 2 hours is extremely excessive- especially since I was a hotel guest.",
      "I stayed one night, but the fee for parking, Internet and a bar charge were more than I paid for the room."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": 4,
    "author": "vlfrance",
    "hotelId": "100585",
    "reviewId": "100585:4",
    "ratingLocation": 4,
    "ratingCleanliness": 4,
    "ratingService": 4,
    "ratingBusiness": -1,
    "ratingValue": 4,
    "segmentLabels": [
      {
        "OTHER": "ip"
      },
      {
        "BUILDING": "p",
        "OTHER": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "ip"
      },
      {
        "OTHER": "ip"
      },
      {
        "LOCATION": "p",
        "SERVICE": "p"
      },
      {
        "ROOMS": "p",
        "SERVICE": "ip"
      },
      {
        "ROOMS": "p"
      },
      {
        "CLEANLINESS": "p"
      },
      {
        "FOOD": "p"
      }
    ],
    "date": "Dec 10, 2008",
    "ratingCheckin": 4,
    "segments": [
      "I always try to book Kimpton Hotels",
      "I've enjoyed staying at Kimpton hotels over the years because of their boutique feel and welcoming atmosphere.",
      "I also appreciate the wine hours and the coffee in the lobby in the morning.",
      "I often eat in the attached restaurants which the chain makes an effort to create a destination restaurant.",
      "The Hotel Vintage Park did not disappoint.",
      "The location is good and the front desk staff are very helpful.",
      "The room was comfortable and I appreciate the ability to get different pillows easily.",
      "Having a bathrobe in the room is wonderful, especially for women traveling for business and trying to keep baggage light.",
      "Housekeeping did a good job and the room was clean and fully stocked with amenities.",
      "The Il Tulio Restaurant was also good for dinner."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": 5,
    "author": "A TripAdvisor Member",
    "hotelId": "292867",
    "reviewId": "292867:248",
    "ratingLocation": -1,
    "ratingCleanliness": 5,
    "ratingService": 5,
    "ratingBusiness": -1,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "OTHER": "x"
      },
      {
        "OTHER": "x"
      },
      {
        "OTHER": "in"
      },
      {
        "OTHER": "ip"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "in"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "ip"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "ip",
        "SERVICE": "ip"
      },
      {
        "SERVICE": "x"
      },
      {
        "CLEANLINESS": "p"
      },
      {
        "OTHER": "x"
      },
      {
        "ROOMS": "ip"
      },
      {
        "ROOMS": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "in"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "BUILDING": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "p"
      },
      {
        "BUILDING": "p",
        "SERVICE": "p"
      },
      {
        "OTHER": "ip"
      }
    ],
    "date": "Mar 7, 2006",
    "ratingCheckin": -1,
    "segments": [
      "Absolutely beautiful!!",
      "Stayed at the resort from Jan.",
      "29-Feb.5, 2006.",
      "We went to the resort for our honeymoon, and reading some of the reviews, it made us sceptical of where we were going.",
      "I dont know what people were complaining about, because we had absolutely NO problems with ANYTHING there!",
      "We went to the steak house (La Cava) and it was great!",
      "The presentation was awesome and you get large portion meals there.",
      "Only I would recommend eating INSIDE the restaurant, instead of eating outside...I got bitten by some flies/bugs out there (about 30 bites on my legs, which were VERY itchy).",
      "We also tried the Mexican and Italian restaurants.",
      "My husband and I both didnt much care for the Italian food, however many others seemed to enjoy it.",
      "Our favorite was the Mexican restaurant, in fact we ended up going there twice during our stay!!",
      "The buffet was quite well...we really enjoyed the omlettes in the mornings!!",
      "There was a LARGE variety of foods to choose from at the buffet and they all had good flavor.I would HIGHLY recommend getting the VIP package....its worth the few extra bucks!",
      "With this you recieve a VERY relaxing massasge, premium brand drinks, and lots of other little extras.",
      "However, you have to mention to the bartenders that you are VIP and tell them that you want 'Brugal' rum (the better rum), and the more expensive vodka...otherwise they might mistake you for NOT being VIP and not receiving the better alcohol.",
      "Our room service from our maids was great, but it also helps if you tip them.",
      "We had brought them alot of gifts from home (ex. shampoos, soaps, books, paper, pens, clothes...)",
      "We have no complaints about our room AT ALL!!!",
      "It was amazing, LARGE bathroom, and a sunk-in living room....it had everything we needed.",
      "We spent half of our stay sun-tanning on the beach, and NEVER had trouble finding a hut or chairs to sit on...dont know what other guests were complaing that they couldnt find a place to sit by the beach.",
      "The other half of the time we tanned by the pool (the one with the swim up bar).",
      "There we had to wake up a bit earlier to find chairs to sit on.",
      "The sun seemed hotter by the pool, but then again you dont have the ocean breeze blowing and cooling you down....which was nice, because we both got bad wind/sun burns sitting by the beach one afternoon.",
      "The main bars that we went to were the swim-up bar during the day and the lobby bar during the evening.",
      "The lobby bar is quite beautiful and relaxing.",
      "We had booked a tour with Turinter (Air Canada affiliated) for the Sanoa Island tour, however that morning the bus that was suppose to pick us up, along with 8 others from our resort, accidentaly missed our resort and left without us all.",
      "It was no problem at all dealing with them about this issue.",
      "They were more than willing to either re-book us, or return our money back IN FULL.",
      "We decided not to re-book seeing it was one of our last days there, and heard from others that went on the tour that it actually wasnt worth the $80 american/person.",
      "They didnt have entertainment on the boat ride at all and never saw ANY fish on their whole tour.",
      "Overall, my husband and I would definately recommend the resort though.",
      "It was absolutely gorgeous and the staff there was amazing.",
      "We did ALOT of walking along the beach everyday there, and thought that our resort had the best part of the beach BY FAR!! It was clean and had the most huts and chairs!We would definately go back, and to those of you who are going you'll have a blast!!"
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": 4,
    "author": "Eelio",
    "hotelId": "620136",
    "reviewId": "620136:2",
    "ratingLocation": 3,
    "ratingCleanliness": 5,
    "ratingService": 5,
    "ratingBusiness": 4,
    "ratingValue": 4,
    "segmentLabels": [
      {
        "SERVICE": "ip"
      },
      {
        "ROOMS": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "LOCATION": "ip"
      },
      {
        "OTHER": "ip"
      }
    ],
    "date": "Sep 10, 2007",
    "ratingCheckin": 5,
    "segments": [
      "Extremely friendly place",
      "We stayed in the two-bedroom villa at Ixora and found the place to be comfortable, perfectly maintained and relaxing.",
      "The staff were as friendly as you'd find anywhere, and the German owner was always accommodating and friendly - giving us an itinerary and booking a driver for a day trip, as well as offering us a lift into town whenever we wanted.",
      "Some people on tripadvisor have stated how the villas are 'out in the sticks', which seems a little churlish as transport is dirt cheap and you're really not far from anything.",
      "If clubbing in Legian is your thing then, fair enough, this may not be what you're after - but if you're after a relaxing holiday where you can take in the island at your own pace, you could do much worse than stay here."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": 5,
    "author": "LOVETOTRAVEL089",
    "hotelId": "150842",
    "reviewId": "150842:179",
    "ratingLocation": 5,
    "ratingCleanliness": 5,
    "ratingService": 5,
    "ratingBusiness": 4,
    "ratingValue": 4,
    "segmentLabels": [
      {
        "OTHER": "ip"
      },
      {
        "OTHER": "x"
      },
      {
        "FOOD": "p",
        "OTHER": "ip",
        "SERVICE": "p"
      },
      {
        "BUILDING": "p",
        "CLEANLINESS": "p",
        "OTHER": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "OTHER": "p"
      }
    ],
    "date": "Mar 23, 2007",
    "ratingCheckin": 5,
    "segments": [
      "Had a fun time!!",
      "Hola my husband and i spent the wk mar 9th to the 16th at this hotel.",
      "We were treated great from the time we walked in the lobby,we had to wait for a room but it was well worth it! We got an upgrade because it was my husbands b-day while we were there and they knew this ..We had a fun- vacation laughing alot at the entertainment group ,they are an asset to the hotel,Black Banana and Leo kept the pool area and beach hopping and they were all good!! We thought the food was good and the weather couldn't have been better.",
      "The evening shows(adult) were fun too...The pool and beach are wonderful,clean and only complaint was the saving of the shade huts,we had to do it too because the sun is intense.",
      ".Don't know what the complaints from other reviews were all about they must be really picky!!!",
      "Would go back but like new adventures everytime. oh get a massage it was heavenly!",
      "Tip the maids etc they work really hard!",
      "Gracias for a great wk....."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": -1,
    "author": "Inavanc",
    "hotelId": "81418",
    "reviewId": "81418:17",
    "ratingLocation": -1,
    "ratingCleanliness": -1,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": -1,
    "segmentLabels": [
      {
        "VALUE": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "ROOMS": "x"
      },
      {
        "BUILDING": "ip"
      },
      {
        "OTHER": "x"
      },
      {
        "ROOMS": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "CLEANLINESS": "p",
        "SERVICE": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "LOCATION": "p"
      },
      {
        "OTHER": "ip"
      },
      {
        "OTHER": "ip"
      },
      {
        "CLEANLINESS": "p",
        "ROOMS": "p"
      }
    ],
    "date": "Apr 27, 2008",
    "ratingCheckin": -1,
    "segments": [
      "Nice stay for a very good price",
      "Since my first stay at the boutiques hotels was very nice i decided that i will check all of them.",
      "Last time i stayed at Metropolis, I picked the Maxwell this time.",
      "The furniture and the decor at my room were old, (in contrast with the other that has new furniture), the mattress also was old, but still comfortable, i never had a bad sleep night.",
      "The hotel were still under renovations for the new look, if it looks now as they promised, it should be looking very modern.",
      "As soon as i registered I were informed that i was up-graded to another room.",
      "I didn't ask why but i had a bigger room than the one i booked, very spacious with two sofas and a table.",
      "I felt like i was at home.",
      "The bathroom was very clean and in general everyone at the hotel were always friendly.",
      "I always felt welcome.",
      "The hotel is very good located, everything is light walk distance, you can also take the BART to the airport, which is very convenient.",
      "I believe that you can considerer yourself fortunate if you find a decent and affordable hotel in the heart of San Francisco.",
      "i forgot to take pictures, but i don't have complains.",
      "Don't expect five stars, but expect a clean and comfortable room."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": 5,
    "author": "iha",
    "hotelId": "256629",
    "reviewId": "256629:84",
    "ratingLocation": 3,
    "ratingCleanliness": 5,
    "ratingService": 4,
    "ratingBusiness": 3,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "BUILDING": "p",
        "OTHER": "p"
      },
      {
        "VALUE": "p",
        "LOCATION": "p",
        "BUSINESS": "p"
      },
      {
        "CLEANLINESS": "p",
        "ROOMS": "p",
        "SERVICE": "p"
      },
      {
        "VALUE": "in"
      }
    ],
    "date": "May 5, 2007",
    "ratingCheckin": 4,
    "segments": [
      "Solid hotel This place is pretty swish, probably what you would expect.",
      "Got a good w/e rate as place is in business district, so area is a bit dead but really well located to get to other areas easily and fast.",
      "Good service, very nicely styled and clean room which was a good size.",
      "Like most hotels of this calibre, the extras eg internet were an absolute rip off though."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": 5,
    "author": "Lumaca",
    "hotelId": "584407",
    "reviewId": "584407:591",
    "ratingLocation": 5,
    "ratingCleanliness": 5,
    "ratingService": 5,
    "ratingBusiness": -1,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "p"
      },
      {
        "BUILDING": "p",
        "CLEANLINESS": "p",
        "CHECKIN": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "CLEANLINESS": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "in"
      },
      {
        "OTHER": "p",
        "SERVICE": "p"
      }
    ],
    "date": "Dec 5, 2006",
    "ratingCheckin": 5,
    "segments": [
      "Loved it!!",
      "My boyfriend and",
      "I stayed at this hotel from Nov 25 to Dec 2.",
      "I was a bit concerned staying at this property because I had heard a few bad things about this resort, but honestly this hotel is the best hotel I've ever stayed in Punta Cana.",
      "Check in was quick, the grounds are huge, and very clean.",
      "The rooms are huge.",
      "You have 6 restaurants to choose from to go eat, you don't need reservations, but keep in mind that at the a la carte restaurants guys can't wear shorts( dress code in full effect) the food was amazing and I'm a picky eater!",
      "Drinks let's see; they pretty much make anything you ask them too.",
      "The beach is huge and very clean, there are plenty of chairs so you don't have to wake up early morning so you can get a chair.",
      "Staff are very friendly.",
      "The shows at night are very nice especially Chicago and the Lion King!",
      "Please put some bug repelant at night there are some mosquitos at night!",
      "There's not really much to stay about this property except that I had an amazing time and that this hotel and the service provided here is amazing, will i recommend this hotel to my friends and will I stay here again; most definately."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": 4,
    "author": "Raoul_Lipschitz",
    "hotelId": "501108",
    "reviewId": "501108:26",
    "ratingLocation": 1,
    "ratingCleanliness": 4,
    "ratingService": 5,
    "ratingBusiness": 5,
    "ratingValue": 4,
    "segmentLabels": [
      {
        "OTHER": "p",
        "LOCATION": "in"
      },
      {
        "LOCATION": "in",
        "BUSINESS": "p"
      },
      {
        "BUILDING": "p",
        "FOOD": "p",
        "ROOMS": "p",
        "SERVICE": "p"
      },
      {
        "BUILDING": "p"
      },
      {
        "LOCATION": "x"
      },
      {
        "LOCATION": "n"
      },
      {
        "LOCATION": "x"
      },
      {
        "LOCATION": "in"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "LOCATION": "ip"
      }
    ],
    "date": "Jul 31, 2007",
    "ratingCheckin": 5,
    "segments": [
      "Great modern hotel away from the action in Barcelona",
      "Great hotel for business conventions (part of the reason for my trip), but far from the life of the city.",
      "In a nutshell, the hotel amenities are fine, staff are friendly and very helpful, the restaurant is good and the rooms are comfortable.",
      "A spa/restaurant/pool on the 13th floor is very nice, although I got a bit tired of Hollywood theme songs played at somewhat annoying volumes.",
      "All rooms have a view of either the ocean or the city.",
      "The only complaint I have is the location.",
      "The Diagonal Mar area around the hotel is one of Barcelona's interventions (urban renewal project).",
      "Nearby is a shopping mall that is indistinuishable from malls anywhere around the world.",
      "I would recommend the tappas bar on the far east end of the terrassa, or explore the sidewalk cafes north of the mall.",
      "Access to the city is through bus 41 (about 35 mins to Pl. Catalunya), the yellow metro line (15 mins to Jaume station near Barri Gotic), or a tram that takes you to the Olympic Village via Pl. Glories (about 15 mins).",
      "Taxi access is very good, located just outside the hotel."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": 4,
    "author": "OCragazza",
    "hotelId": "304289",
    "reviewId": "304289:31",
    "ratingLocation": 4,
    "ratingCleanliness": 4,
    "ratingService": 4,
    "ratingBusiness": 5,
    "ratingValue": 4,
    "segmentLabels": [
      {
        "LOCATION": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "LOCATION": "p"
      },
      {
        "LOCATION": "ip"
      },
      {
        "BUILDING": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "SERVICE": "p"
      },
      {
        "FOOD": "x",
        "SERVICE": "in"
      },
      {
        "VALUE": "n"
      },
      {
        "OTHER": "n",
        "LOCATION": "in"
      },
      {
        "OTHER": "p"
      },
      {
        "LOCATION": "in"
      },
      {
        "NOTRELATED": "x"
      }
    ],
    "date": "Apr 17, 2008",
    "ratingCheckin": 5,
    "segments": [
      "Excellent Traveling Location",
      "We booked our trip to Japan through a Japanese travel agency and this hotel was part of the package deal.",
      "It is a good location in that it is near the Shinjuku station, which is one of the major subway and JR line stops.",
      "There is also a free shuttle to and from the station, which helped (though the walk isn't bad).",
      "The hotel seems a litle nicer than your standard Hilton hotels in the US.",
      "We stayed here twice - a few days when we arrived and then a few days before we headed home.",
      "Service was great and we used the concierge service numerous times to find good restaurants around the area.",
      "It's a hit and miss with staff speaking English, although for the most part they understood us.We only ate breakfast at the hotel, which was a Japanese and Western style buffet that was excellent.",
      "However, we skipped eating restaurants on the second floor as they were a bit pricey.",
      "If Tokyo is the only city you're visiting I'd probably recommend a different hotel as Shinjuku is a business district and pretty quiet at night unless you hang out at the station (the shuttle service ends around 9:30PM).",
      "If Tokyo is one of many cities on your agenda, I thought this was a great choice.",
      "Only downside is the JR to Kyoto/Osaka leaves from Tokyo station, so you have to change stations if you venture west.",
      "I strongly recomend getting the JR pass if you do so."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": -1,
    "author": "lagunamarie",
    "hotelId": "674915",
    "reviewId": "674915:23",
    "ratingLocation": -1,
    "ratingCleanliness": -1,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": -1,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "SERVICE": "p",
        "VALUE": "p",
        "LOCATION": "p"
      },
      {
        "VALUE": "ip"
      },
      {
        "ROOMS": "p",
        "VALUE": "ip"
      },
      {
        "ROOMS": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "ROOMS": "x"
      },
      {
        "ROOMS": "ip"
      },
      {
        "ROOMS": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "FOOD": "n",
        "ROOMS": "p"
      },
      {
        "FOOD": "in"
      },
      {
        "FOOD": "n"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      }
    ],
    "date": "Apr 6, 2008",
    "ratingCheckin": -1,
    "segments": [
      "Best Hotel in",
      "NY - PERIOD.",
      "WOW!",
      "Perfect location, very friendly staff, and very good rate for St Patrick's Day weekend.",
      "(about $220 everything included).",
      "The room was bigger than my first apartment - I challenge you to find a room bigger than this for under $1,000.",
      "New, sleek, modern COMFORTABLE furniture.",
      "An actual working fireplace in the room, but I don't know if they let guests use it.",
      "Charming chair and reading lamp was just beautiful.",
      "The windows overlooked a playground and courtyard, and it was almost silent during our stay.",
      "We were right next to the elevator, and didn't hear a thing.",
      "Big flat panel TV, plus DVD/VCR unit.",
      "The sitting area had a really comfy couch that I slept on w/o any problems (but I am only 5 feet /152cm tall), fridge in room so you can have your own food in there.",
      "The bathroom was HUGE - probably 8x11ft/ 2.4m x 16.7m?)",
      "and also had a window that you could open .",
      "It was nice to get real fresh air in, not some noisy, useless fan.The only drawback was that the complimentary breakfast ended at like 9am.",
      "It should go to 11 at least, but most US hotels end at 9.",
      "Boooh.",
      "Anyway, I cannot say enough good things about this hotel.",
      "It was far better than the Waldorf and Sheraton in every way."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 1,
    "ratingRoom": -1,
    "author": "A TripAdvisor Member",
    "hotelId": "87090",
    "reviewId": "87090:154",
    "ratingLocation": -1,
    "ratingCleanliness": -1,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": -1,
    "segmentLabels": [
      {
        "ROOMS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "CLEANLINESS": "n",
        "ROOMS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "BUILDING": "n"
      },
      {
        "BUILDING": "n"
      },
      {
        "BUILDING": "n"
      },
      {
        "ROOMS": "x"
      },
      {
        "ROOMS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "VALUE": "n",
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      }
    ],
    "date": "Nov 17, 2004",
    "ratingCheckin": -1,
    "segments": [
      "Needs Updating Arrived after late flight and walked into my room and my heart sank.",
      "It was terrible!",
      "Poky and small.",
      "Bathroom was tiny with a dirty sink.",
      "I had asked for a non smoking room and room smelt faintly of smoke.",
      "Bed was nice although the smell of tabacco wafted up your nose as you were trying to sleep.",
      "There was no room to put down my 3 suitcases.",
      "We had to walk around them.",
      "The balcony/lanai frightened me...",
      "it was old and I wondered how much rust was being covered by the paint!",
      "I might fall over if I lent on the bars!",
      "I had a 2 room upgrade!",
      "I wouldn't have liked to have stayed in my original room...",
      "it would have been far worse experience than what I had.",
      "I'd give it about a 3 or 4 out of 10!!",
      "Looks nothing like the picture in brochures!!!",
      "For value for money, the Royal Hawaiian, Moama Surf or Sheraton might be approx $100 per night dearer, but you are getting about $400 more in value.",
      "Worth the extra money!!"
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": -1,
    "author": "A TripAdvisor Member",
    "hotelId": "232501",
    "reviewId": "232501:91",
    "ratingLocation": -1,
    "ratingCleanliness": -1,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": -1,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "OTHER": "x"
      },
      {
        "OTHER": "p"
      },
      {
        "CLEANLINESS": "p",
        "ROOMS": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "LOCATION": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "SERVICE": "p"
      }
    ],
    "date": "Oct 21, 2004",
    "ratingCheckin": -1,
    "segments": [
      "I Had a Great Experience!",
      "I was a little worried when I read some recent reviews of this hotel.",
      "I'm glad I chose to stay at the Singel!",
      "The desk clerk joked that I had the smallest room in all of Amsterdam and he was probably right but it suited my needs perfectly: a very clean, quiet room with all the amenities (shower, TV w/cable).",
      "I requested a non-smoking room and the room was bright, modern, airy and smoke-free!",
      "The location is fabulous - near Centraal Station but on a quiet canal virtually in the city center but close to the western side of town with great shops and restaurants.",
      "Breakfast at Singel included an array of meats, cheeses, fruit, toasts, yogurt, granola, juice.",
      "Each table gets a carafe of coffee/tea.",
      "Friendly service - yes you leave your room key but this is common in Europe! Would I stay here again? Yes!!"
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": 5,
    "author": "cmm3",
    "hotelId": "489057",
    "reviewId": "489057:26",
    "ratingLocation": 5,
    "ratingCleanliness": 5,
    "ratingService": 5,
    "ratingBusiness": 5,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "p"
      },
      {},
      {},
      {},
      {},
      {
        "SERVICE": "p",
        "VALUE": "n",
        "ROOMS": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "BUILDING": "p"
      },
      {
        "BUILDING": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "BUILDING": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "CHECKIN": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "ROOMS": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "BUILDING": "p"
      },
      {
        "ROOMS": "n"
      },
      {
        "ROOMS": "in"
      },
      {
        "SERVICE": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "p",
        "SERVICE": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "VALUE": "n"
      },
      {
        "OTHER": "p"
      },
      {
        "VALUE": "p"
      },
      {
        "LOCATION": "p"
      },
      {
        "LOCATION": "p"
      },
      {
        "LOCATION": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "LOCATION": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "ip"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "in"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      },
      {},
      {},
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "ip"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "p"
      },
      {
        "NOTRELATED": "x"
      }
    ],
    "date": "Dec 10, 2007",
    "ratingCheckin": 5,
    "segments": [
      "A top choice in Barcelona",
      "I spent two nights at the Casa Fuster from 26-28 November.",
      "I had spent two nights at the Hotel 1898 on Las Ramblas before checking in to the CF, and although a night in a Standard room at the CF was 110 Euro a night more expensive than a Superior room at the 1898, the CF truly is in a different class than the 1898 and is worth the extra money.I should say however that a local travel agent quoted me a rate of Euro 240/night inclusive of breakfast at the CF for the weekend of November 17th, but I ended up having to change my travel dates due to work.",
      "For the days I traveled 鈥?",
      "even though I did not stay at the CF on a weekend 鈥?",
      "were much more expensive 鈥?",
      "at Euro 330/night not including breakfast.",
      "Obviously, it would have been great to get the cheaper rate, but I would pay the higher rate again for a chance to stay at the Casa Fuster where the service and the accommodations are truly top notch.",
      "Let mention that I have a love-hate relationship with large hotels.",
      "I like the hustle and bustle of crowded lobbies and get kind of depressed when I am staying at smaller boutique hotels that have empty-ghost town lobbies.",
      "That doesn鈥檛 mean I am a fan of large numbers of tour busses dropping off tourists to gawk and gape while they wait in line for afternoon tea.",
      "Still, my second impression of the CF (the 1st being the absolutely stunning building exterior 鈥?",
      "wow!)",
      "with bellhops coming and going and groups congregating all over the lobby was 鈥渘ow this is a real hotel鈥?",
      "I would say that the CF and the 1898 are of similar size, but the lobby of the CF was much more lively than the 1898 although they both had high occupancy during my stay.",
      "The 1898 does have a somewhat larger lobby however so this may account for why it seemed so sparkly populated.",
      "After check in I decided to walk around town a bit.",
      "Of course, the first thing I noticed as I was walking back up Pasaig de Gracia towards the hotel was a Large grey tour-bus parked outside the hotel.",
      "Oh well.",
      "Guess you cant have the crowded lobby without the obligatory tour bus parked outside.",
      "Still, this lobby was crowded in the way I enjoy so I cannot fault it Although I expected the Standard room at the CF to smaller than the superior room at the 1898, the room at the CF had a very, very large, luxurious marble bathroom reminiscent of the bathroom at the Hotel de Russie in Rome.",
      "I think the bathroom is the most important part of a hotel room and would gladly give up extra room real estate if it would buy me a larger bathroom.",
      "You could comfortably fit two people in this bathroom which I appreciated even though I was traveling alone.",
      "In fact the entire CF reminded me of a smaller version of the de Russie.",
      "Something about the decor, and the layout of the hallways though I can鈥檛 put my finger on it.",
      "I did have a minor problem with the shower 鈥?",
      "either there was no shower curtain or glass panel to keep the water from spilling all over the place, or I just count figure out how to use it, but I ended up making a minor flood in the bathroom that I had to use up all my towels to dry up.",
      "Thankfully when I returned to my room the attendants who had done turn-down service had replaced my wet towels with fresh ones.",
      "Although the CF felt from the start like a real deluxe experience, it proved itself to be such on my very first night there.",
      "After a long day of sightseeing in the area around Palau Nacional I wanted to enjoy a glass of wine in the Lobby bar before heading off to dinner in town.",
      "Regretfully, there was a private event going on at the time and the gentleman at the front desk apologized and offered to have me served in the upstairs library-quite area which I happily accepted.",
      "Shortly after finding a place to sit where I could write my postcards a waiter appeared to take my order.",
      "When he returned her informed me that the glass of wine was 鈥渙n the house,鈥?",
      "which could not have made me happier.",
      "Very unexpected and very, very nice.",
      "Skeptics might say that a small gesture like that is not worth the extra Euro 110/night over my other choice for accommodation, but to me it makes all the difference.I did eventually make my way to the lobby bar after midnight where I enjoyed a glass of Cava, finger foods, and deserts.",
      "The later was on the pricey side but no more than I expected to pay at such a fine hotel.",
      "Although I would stay at the 1898 again, if I budget was not a constraint I would choose the CF hands down.",
      "You pay more, but you get so much more.",
      "This was my second trip to BCN and some of the TripAdvisor members warned that the area has become a lot more touristy than in it was in 1997, I didn鈥檛 really find that to be the case.",
      "Still, L鈥橢ixample is not all that far away from Placa Catalunya and Pasaig de Gracia is really so nice to stroll along 鈥?",
      "leisurely or otherwise.",
      "There is no reason to stay on Las Ramblas.",
      "Even if you are not a walker, the Diagonal Metro station is only two stops form the Ramblas.",
      "A note of caution for those of you who only travel by car or taxi: At 11 AM on a Monday morning to took over 30 minutes to travel from the Hotel 1898 (on Las Ramblas) to the CF.",
      "I could have walked to the CF in just over half that time if I didn鈥檛 have a large suitcase with me.I would also like to try the Hotel Majestic, which is only 2 or 3 blocks from the CF and so many Trip Advisor members have spoken so highly of it.",
      "But I wouldn鈥檛 think twice about staying at the CF again.",
      "I cannot fault the experience 鈥?",
      "well maybe the 5 pound room key system REALLY does need to be done away with in favor of a keycard 鈥?",
      "but otherwise it was truly wonderful.",
      "I never made it to breakfastas I had saved that for my checkout day but ended up having to check out at 4:30 AM due to a last minute change in my travel plans.",
      "The reviews on TA are a little bit misleading for the CF.",
      "I noticed a lot of people gave the CF 4-out-of-5 while nearly all the reviews of the 1998 are 5-out-of-5.",
      "These reviews, coupled with the uber-cheap rate I was originally given for the CF, made me originally want to avoid it.",
      "Too often have I stayed at a 鈥済reat鈥?",
      "hotel at a steep discount and regretted doing so.",
      "I was seriously afraid that the CF was past its prime.",
      "Thankfully the CF was everything I expected 鈥?",
      "actually better b/c it surpassed the 1898 鈥?",
      "truly a tough act to follow 鈥?",
      "in so many ways.",
      "But I would explain the stellar reviews that the 1898 gets by saying that it probably exceeds people鈥檚 expectations as a 4 star hotel while it sounds like the CF sometimes does not live up to people鈥檚 expectations.",
      "I would say that the CF met my expectations in every way and exceeded them in certain ways as well.",
      "The 1898 may be a better value because it is much, much more affordably priced while offering many similar amenities and services.",
      "But there really is no comparison.",
      "These hotels have a different vibe 鈥?",
      "that of the CF is decidedly more up-market.",
      "Of course most of the tourists in both hotels were Americans and the dollar is just not what it used to be.",
      "I believe people are judging by 鈥渂ang for the buck鈥?鈥?",
      "as Euro 300 is now worth closer to $450 while it once was as little as $240..",
      "a whopping 87% increase in 6 years.",
      "That is no small consideration.",
      "The CF is amongst the best in Barcelona.",
      "I hope to eventually stay at the Majestic and may find myself at the Hotel Arts at some point, which I visited for lunch one day and felt like I was in Battery Park City, NYC 鈥?",
      "totally cut off from the rest of the city.",
      "And what鈥檚 up with the lack of a restaurant on a high floor?",
      "How could they forget to utilize the best amenity they have, and charge dearly for: the stellar views!",
      "It must be reserved for hotel guests (no less than one nights stay is the cost of admission to what is probably one of the most spectacular vistas in the Mediterranean).",
      "And they probably want to avoid the afternoon tea phenomenon 鈥?",
      "not that I blame them.",
      "In the meantime, the Casa Fuster will be for me the best place to sty in Barcelona.",
      "Hopefully it wont take me 10 years to go back to BCN like it did this time."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": -1,
    "author": "A TripAdvisor Member",
    "hotelId": "237158",
    "reviewId": "237158:20",
    "ratingLocation": -1,
    "ratingCleanliness": -1,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": -1,
    "segmentLabels": [
      {
        "OTHER": "p",
        "LOCATION": "x"
      },
      {
        "LOCATION": "p",
        "ROOMS": "p"
      },
      {
        "SERVICE": "p"
      }
    ],
    "date": "Oct 31, 2004",
    "ratingCheckin": -1,
    "segments": [
      "Central but quiet Hotel",
      "Nacciones is very centrally located ,but our interior room, altho small was very quiet.",
      "The service from the delightful staff was excellent."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 3,
    "ratingRoom": 3,
    "author": "left_at_eaglecap",
    "hotelId": "235513",
    "reviewId": "235513:20",
    "ratingLocation": 4,
    "ratingCleanliness": 3,
    "ratingService": 3,
    "ratingBusiness": 2,
    "ratingValue": 1,
    "segmentLabels": [
      {
        "OTHER": "n"
      },
      {
        "VALUE": "n"
      },
      {
        "ROOMS": "n",
        "SERVICE": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "OTHER": "in",
        "NOTRELATED": "x"
      }
    ],
    "date": "Oct 30, 2008",
    "ratingCheckin": 2,
    "segments": [
      "Small, expensive and pretentious",
      "I guess I expected more for $450 per night.",
      "What I got was a very small room, staff with a bit of an attitude and a double hold on my credit card amounting to twice the amount I paid for the three nights I was there.",
      "I took nearly a week's worth of phone calls to get these erroneous hold removed from my account.",
      "Stay at the Embassy Suites at Dupont Circle, you will have much more room, al ot less attitude all at less than half the cost of the Sofitel."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 2,
    "ratingRoom": -1,
    "author": "ontheroadsales",
    "hotelId": "239800",
    "reviewId": "239800:9",
    "ratingLocation": -1,
    "ratingCleanliness": -1,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": -1,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "CHECKIN": "x"
      },
      {
        "VALUE": "in"
      },
      {
        "ROOMS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "CLEANLINESS": "p",
        "ROOMS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "CHECKIN": "x",
        "OTHER": "in"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "ROOMS": "n"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "SERVICE": "x"
      },
      {
        "SERVICE": "in"
      },
      {
        "SERVICE": "in"
      },
      {
        "SERVICE": "n",
        "VALUE": "n"
      },
      {
        "FOOD": "p",
        "OTHER": "p"
      },
      {
        "CHECKIN": "in"
      },
      {
        "LOCATION": "p"
      },
      {
        "LOCATION": "n"
      }
    ],
    "date": "Aug 24, 2007",
    "ratingCheckin": -1,
    "segments": [
      "Good and questionable",
      "Upon check in I was given a Double room.",
      "I reserved a King room but was told only a double was available ( Same price).",
      "That was ok since I assumed a double' meant two beds ( as indicated on their website) Well, My room was located behind the elevators with a double bed.",
      "That is one double size bed just larger than a twin.",
      "the bed was against the wall of the SMALLEST room I have ever stayed in other than a hostel in my college days.",
      "I admit the room was clean and nice.",
      "But, SMALL.",
      "After checking in I looked at the hotels website and they still listed King, and King Deluxe room available for the same night.",
      "I travel every week and try new hotels in the areas I travel, To find a nice hotel with a good work environment.",
      "As you can imagine I was not happy with the SMALL room but accepted it.",
      "I needed to get work done and on to my Clients.",
      "When I checked out I talked to the Manager Christine.",
      "She told me it was up to the the front desk clerk to assign me a room at THEIR discrestion.",
      "Since I was traveling alone they needed to give me a double to have a king available for other guests.",
      "The Manager said this is their policy and did not feel they need to reduce my rates for my (small) room.",
      "The Pro's: Great workout facility and snack pantry.",
      "MAKE SURE YOU KNOW WHAT ROOM YOU ARE GIVEN PRIOR TO LEAVING THE FRONT DESK.",
      "This hotel is in a great location for driving to most areas of Phoenix.",
      "There is not very much in walking distance."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 1,
    "ratingRoom": -1,
    "author": "Rach&Chris",
    "hotelId": "634363",
    "reviewId": "634363:423",
    "ratingLocation": -1,
    "ratingCleanliness": -1,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": -1,
    "segmentLabels": [
      {
        "OTHER": "n"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "n"
      },
      {
        "CHECKIN": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "CLEANLINESS": "n",
        "ROOMS": "n"
      },
      {
        "BUILDING": "n"
      },
      {
        "FOOD": "n"
      },
      {
        "FOOD": "n"
      },
      {
        "FOOD": "in"
      },
      {
        "FOOD": "in"
      },
      {
        "SERVICE": "in"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "CLEANLINESS": "n",
        "NOTRELATED": "x"
      },
      {
        "CLEANLINESS": "n"
      },
      {
        "CLEANLINESS": "in"
      },
      {
        "SERVICE": "n"
      },
      {
        "OTHER": "n",
        "NOTRELATED": "x"
      },
      {
        "OTHER": "n"
      }
    ],
    "date": "Mar 1, 2007",
    "ratingCheckin": -1,
    "segments": [
      "Hell hole!!",
      "We stayed at this hotel the week starting the 22nd",
      "Jan 2007 and it was truly horrendous!!",
      "Check in was a joke, we were waiting ages for our room.",
      "Our room was absolutely appalling we had holes in our wall, plug sockets came away from the wall when they were used, holes and cigarette burns in the bedding, the fuse box had no cover (not exactly ideal if you have kids) my boyfriend had 2 open the wardrobe for me everytime I wanted something out of it as it came off its runners and would get jammed!",
      "We had holes in our roof were at night we developed a skylight, the bath was full of chips and marks with limescale and dirt covering the plug hole and shower head, the toilet blatantly hadnt been cleaned for a long time and the only way to open the plug in the sink was by using scissors!",
      "not to mention the general state of the hotel, wires dangling on corridors, smashed roof tiles and cracks in the floor!",
      "The worst bit however had to be 'alcatraz' the buffet restaurant, were birds and flies freely roamed all over the food, this put us off so much that we booked into an a la carte everynight as we refused to eat the contaminated food!",
      "However it was at the a la carte 'Roma' where we dined with another couple who we had met on holiday that, my boyfriend, myself and our friends all contracted food poisoning.",
      "We were really ill my boyfriend shaking severely and we all had diarrhoea and vomiting.",
      "This continued for the duration of the holiday and I have still not fully recovered almost a month after being at home!",
      "When we went to the rep about this problem she claimed that 'noone else had reported being ill' although since getting home we have read many reports on the thomson website suggesting otherwise!",
      "I would also not advise the trips especially Saona and Rancho Jonathan.",
      "Saona was filthy, condoms and condom wrappers on the beach (I have stayed in San Antonio, Ibiza on three occasions and never seen anything like this!)",
      "also the toilets were covered in pools of urine and absolutely stank!",
      "Rancho Jonathan was definately not up2 UK standards, my friend teaches horse riding and she was mortified when I told her what happened to us.Sanitation in general in the hotel was appalling we were left without electricity on some occasions which meant we also did not have running water.",
      "Almost every day there was a problem with the water so toilets could not be flushed and hands could not be washed, my alcohol wipes for my hands that I took were a saviour!",
      "So it is no wonder that people become ill in these conditions.",
      "We also found the staff to be rude, and we noticed that service was only good if it involved big tips.",
      "On a positive note the beach outside the hotel was really nice and the monster trucking trip was really good, just a shame about the rest of the holiday, We feel completely ripped off and disappointed and its definately put us off returning to the carribean.",
      "This hotel is not a 4* in any stretches of the imagination, and I have travelled to many places, I would rate this hotel as a 2* and thats being kind!"
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 1,
    "ratingRoom": 1,
    "author": "A TripAdvisor Member",
    "hotelId": "239021",
    "reviewId": "239021:27",
    "ratingLocation": -1,
    "ratingCleanliness": 1,
    "ratingService": 2,
    "ratingBusiness": -1,
    "ratingValue": 1,
    "segmentLabels": [
      {
        "VALUE": "n"
      },
      {
        "OTHER": "n",
        "LOCATION": "n"
      },
      {
        "LOCATION": "n",
        "SERVICE": "n"
      },
      {
        "FOOD": "p",
        "ROOMS": "n"
      },
      {
        "ROOMS": "p"
      },
      {
        "ROOMS": "ip"
      },
      {
        "BUILDING": "n"
      },
      {
        "CLEANLINESS": "n",
        "VALUE": "n"
      }
    ],
    "date": "Apr 21, 2006",
    "ratingCheckin": -1,
    "segments": [
      "Very Expensive for what it is Area:",
      "Not great, quite a walk to Dam Square and Central Station (I wouldn't want to do it with cases).",
      "This hotel is situated on a major (and noisy) roadParking: I was lead to believe it would be free...not so...you'll pay E25 per day...and I wasn't convinced about the security of my car at all.Customer Service: Friendly but not particularly helpful, equal to that of a (above average)hostel.",
      "Breakfast: Actually, not bad at all, I enjoyed it (even though I did feel as though I waas sitting in a chinese resturant, very odd.Rooms: It seemed that they had crammed as many beds in each room as possible, I had 4 single beds in my room, I have no idea why, I was taveling alone.",
      "I do have to comment on the sheets though, very comfortable...felt as soft as a baby's arse.",
      "I slept very well.",
      "Decor: Left a LOT to be desired, painting and carpeting was very shoddy and heavily used, it looked like the owner had got a couple of his mates to do the maintenance and they had taken him for a ride, this place seriously feels like a low budget motel, for a high star rated price.",
      "I didn't dare us ethe shower for fear of contracting some nasty fungal growth, bathroom was unacceptably dirty (and the light didn't work)I wouldn't stay here again, there are much better and more professional places for the same price"
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": 3,
    "author": "VacationItch",
    "hotelId": "611703",
    "reviewId": "611703:98",
    "ratingLocation": 4,
    "ratingCleanliness": 4,
    "ratingService": 2,
    "ratingBusiness": 4,
    "ratingValue": 4,
    "segmentLabels": [
      {
        "SERVICE": "x"
      },
      {
        "SERVICE": "p"
      },
      {
        "SERVICE": "in"
      },
      {
        "SERVICE": "n"
      },
      {
        "OTHER": "in",
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "ip"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "n"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "n"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "x"
      },
      {
        "SERVICE": "n"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "x"
      },
      {
        "SERVICE": "in"
      },
      {},
      {
        "OTHER": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "OTHER": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "CLEANLINESS": "p",
        "NOTRELATED": "x"
      },
      {
        "CLEANLINESS": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "OTHER": "ip"
      },
      {
        "VALUE": "p"
      }
    ],
    "date": "Apr 9, 2007",
    "ratingCheckin": 2,
    "segments": [
      "Pros and Cons Service:",
      "The service was okay, its only once you got to know the staff you received better service.",
      "Majority of the staff speaks Spanish, my husband and I had challenges with the communication as we only spoke English.",
      "The room service was slow it take approximately 1 hour or so.",
      "Hotel- I would recommend staying at the Royal side, you get better service.",
      "Also, you receive a 30 minute free massageBeach- The beach is bit of a walk from the Royal and the other side of the resort.",
      "Restaurant:Japanese- My husband and I loved the food.",
      "They serve you a variety of sushi.",
      "The food is cooked right in front of you.",
      "The first part is Shrimp Noodles and Fish.",
      "The second part of the meal is Chicken Breast and Beef with Fried Rice.",
      "We really enjoyed it!",
      "Mexican- This was our second favourite restaurant.",
      "The soup was good, we had the chicken tacos for appetizer.",
      "We went to this restaurant twice.",
      "Steak, Fajitas Fish with rice was really good.",
      "The dessert was good as well.",
      "This is the only place on the resort they have Corona beer.",
      "Steak/American- My husband enjoyed the steak, you can ask the waiter to look at the different cuts for the steak.",
      "I don't eat Red Meat this was a challenge for me, I ordered the Chicken Strips and it was horrible.",
      "If you dont eat Steak don't bother going to this restaurant.",
      "Only place on the resort they have Budweiser beer.",
      "French- We enjoyed this restaurant, we had sole and duck.",
      "The dessert was nothing spectacular.",
      "Thalasa- I had the fish it was okay, the French was better.",
      "My husband had the lobster it was more like Scampi.",
      "If you stay on the Royal side you can have breakfast/lunch here everyday.",
      "Its better than the buffet lunch.",
      "Every other day at lunch there was buffet at ThalasaBuffet- The food is made in large quantity so its not flavorful.",
      "We did not enjoy the service and it was extremely crowded.",
      "Crepe Restaurant- This was good we went there everyday.",
      "You can order off the menu.",
      "They don't understand English, just point to the item on the menu.",
      "Bars/Disco- We had challenges with communication as not many of them speak English.",
      "We went to the disco twice, its okay nothing to rave about.",
      "Show- The shows are repetitive so we stopped going after a few days.",
      "I would not recommend this for kids there is lots of Booty Shaking.",
      "Amenties: My husband enjoyed the 9 hole golf.",
      "The clubs and cart was $10 USTips: We tipped everyday and found it very rude that almost any of the Europeans tipped.",
      "I would recommend people help the staff by tipping and its about time the Europeans tip as well.",
      "There were only a few Europeans that tipped, it is all inclusive but you should tip its common courtesy.",
      "A few dollars go a long way for the staffHotel: The rooms are clean, just place the sign on the door to clean your room.",
      "I saw a Cockroach once during my stay.",
      "Overall: I dont think we will go back to this resort b/c of the language barrier and the fact that I dont eat red meat and I got sick of eating Seafood all week.",
      "Apprantely in speaking with other travellers this is one of the better 4.5 resorts.",
      "You are getting good value for the price of this resort."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": 5,
    "author": "DublinTravelOne",
    "hotelId": "219988",
    "reviewId": "219988:254",
    "ratingLocation": 5,
    "ratingCleanliness": 5,
    "ratingService": 4,
    "ratingBusiness": -1,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "LOCATION": "p"
      },
      {
        "VALUE": "p"
      },
      {
        "VALUE": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "ROOMS": "x"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "OTHER": "p"
      }
    ],
    "date": "Sep 4, 2007",
    "ratingCheckin": 4,
    "segments": [
      "My new favourite hotel in Paris!",
      "I visit Paris for business 3 or 4 times a year and this was my first time staying at Hotel des Grands Hommes.",
      "I chose it based on reviews on Trip Advisor, its location close to Jardins de Luxembourg (a beautiful spot in Paris for a Saturday morning stroll) and its convenience for getting to the airport (it is very close to the RER station Luxembourg which is on the airport line).",
      "The rates were very good on the hotel's website (summer special).",
      "If you can get this hotel at a good price I would defintely recommend it.",
      "The rooms are a good size (for Paris) - beuatifully decorated (completely over the top but very stylish and comfortable).",
      "The rooms at the front overlook the Pantheon - a little noisy on the Friday night I stayed there but it didn't last too late and so sleeping wasn't a problem.",
      "The breakfast (鈧?",
      "2) was very good - a good selection of cold meats, cheese, bread, pastries, cereal, yoghurt, juice and tea/coffee.",
      "The staff were polite and helpful.",
      "I have a new favourite hotel in Paris!"
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 2,
    "ratingRoom": 2,
    "author": "Judarell",
    "hotelId": "111969",
    "reviewId": "111969:46",
    "ratingLocation": 5,
    "ratingCleanliness": 3,
    "ratingService": 4,
    "ratingBusiness": 3,
    "ratingValue": 3,
    "segmentLabels": [
      {
        "OTHER": "x"
      },
      {
        "LOCATION": "p"
      },
      {
        "BUILDING": "p",
        "SERVICE": "p"
      },
      {
        "SERVICE": "ip"
      },
      {
        "ROOMS": "in"
      },
      {
        "ROOMS": "in"
      },
      {
        "CLEANLINESS": "p",
        "ROOMS": "x"
      },
      {
        "BUILDING": "in",
        "VALUE": "p"
      }
    ],
    "date": "Aug 12, 2007",
    "ratingCheckin": 4,
    "segments": [
      "Not Bad.",
      "The hotel is in an ideal location, a few walking blocks from Bourbon St, just away enough from the action to have a good night's sleep.",
      "The lobby is small yet welcoming, and staff was very friendly.",
      "Bell hop went out of his way to have a taxi wait for us that was scheduled to take us back to the airport.",
      "The room we had faced a brick wall, so there was no sunlight at all.",
      "Unfortunately there were no other rooms available that weekend to upgrade to.",
      "The room itself was very small but it suited our needs, which was basically to have a clean place to relax and to sleep.",
      "I would probably stay in a nicer hotel next time, but for the price it was okay."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": -1,
    "author": "MGB",
    "hotelId": "229021",
    "reviewId": "229021:32",
    "ratingLocation": -1,
    "ratingCleanliness": -1,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": -1,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "LOCATION": "p"
      },
      {
        "VALUE": "p"
      },
      {
        "LOCATION": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "SERVICE": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "FOOD": "x"
      },
      {
        "SERVICE": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "NOTRELATED": "x"
      }
    ],
    "date": "Oct 24, 2007",
    "ratingCheckin": -1,
    "segments": [
      "Excellent Location-Very Good 3 Star",
      "This is the perfect hotel for a stay in Florence.",
      "Directly in the heart of the city on the main pedestrain only street this hotel is absolutely perfect unless you want to spend alot more money for something more elegant.",
      "Anything else this price was on the outskirts.",
      "To me in the city, its location thats most important.",
      "The police assured me that to get to the hotel I could drive on the pedestrian only streets which were packed with what else, pedestrians, and so I did, slowly.",
      "Drop the car at the hotel door and a driver comes to take it to the parking garage.",
      "Very convenient.",
      "A typical european good breakfast is included.",
      "Some reviewers said the employees have an attitude, and perhaps they do, slightly, but I have found most city hotel employees to have an edge to them, and I am thankful for it.",
      "They were professional, helpful when asked, and efficient at everything we requested.",
      "Its a sophisticated classy city, enjoy it."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": -1,
    "author": "A TripAdvisor Member",
    "hotelId": "506418",
    "reviewId": "506418:196",
    "ratingLocation": -1,
    "ratingCleanliness": -1,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": -1,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "ip",
        "LOCATION": "x"
      },
      {
        "LOCATION": "p"
      },
      {
        "LOCATION": "p"
      },
      {
        "LOCATION": "p",
        "ROOMS": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "VALUE": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "OTHER": "p",
        "VALUE": "p"
      }
    ],
    "date": "May 23, 2005",
    "ratingCheckin": -1,
    "segments": [
      "was blown away by Hotel Vitale",
      "With all the great hotels in San Francisco it is hard to believe that there was room for one more.",
      "My friend had recommended the Hotel Vitale which just opened right across from the Ferry Building.",
      "We had views of the water and Bay Bridge from our hotel.",
      "Without a doubt the best views in San Francisco (and yes I have stayed at Mandarin and Park Hyatt).",
      "In addition to the great location and views the bed was without a doubt the most comfortable bed I have ever slept in.",
      "Also, the room had cool amenities like electric shades, Bose i-pod deck, DVD and flat screen TVs.It is one of the Joie De Vivre (spelling?)",
      "properties so the price was nice $199.",
      "the restaurant was yummy and the hotel is small enough that after 3 days we had a chance to get to know the staff.",
      "Anyway I loved the hotel and am the first one to right a nasty review so i thought I would take the time to let others know that there is a good value and great hotel waiting for them at Hotel Vitale."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 1,
    "ratingRoom": 1,
    "author": "andrews-sisters",
    "hotelId": "222959",
    "reviewId": "222959:79",
    "ratingLocation": 2,
    "ratingCleanliness": 1,
    "ratingService": 1,
    "ratingBusiness": -1,
    "ratingValue": 1,
    "segmentLabels": [
      {
        "OTHER": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "ROOMS": "in"
      },
      {
        "ROOMS": "in"
      },
      {
        "ROOMS": "in"
      },
      {
        "SERVICE": "n"
      },
      {
        "CLEANLINESS": "n"
      },
      {
        "ROOMS": "n",
        "SERVICE": "n"
      },
      {
        "SERVICE": "x"
      },
      {
        "SERVICE": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "SERVICE": "x"
      },
      {
        "SERVICE": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "OTHER": "n",
        "VALUE": "n"
      }
    ],
    "date": "Jan 9, 2007",
    "ratingCheckin": 1,
    "segments": [
      "Should have been so much better",
      "There were 3 adults but when we arrived they gave us a double room and told us that was all they had, even though they knew that 3 of us were coming.",
      "They arranged for a roll away bed to be put in the room while we went out to eat.",
      "When we came back we had to rearrange the furniture to get around in the room.",
      "The roll away bed had a sheet and a folded blanket on it.",
      "When I asked for a duvet I was told that they didn't have a spare one!",
      "We had to tell them about stains on the toilet wall twice before it was cleaned.",
      "We complained about the room at reception to a lady who spoke to us in English.",
      "A gentleman from reception was speaking to another guest in English.",
      "They then both started to discuss the problem we had infront of us - but not in English!",
      "I thought that was very rude.",
      "The lady then looked to see if she could move us to a sister hotel.",
      "She was not able to so then offered us a refund.",
      "I declined this because if she was unable to get us a room how were we supposed to?",
      "We thought we were going to get 5 star luxury but we didn't.",
      "We were treated like second class citizens.",
      "We have stayed in New York many,many times over the years and this was the most expensive hotel stay and the worst."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 3,
    "ratingRoom": 4,
    "author": "chrisgp",
    "hotelId": "302511",
    "reviewId": "302511:28",
    "ratingLocation": 4,
    "ratingCleanliness": 4,
    "ratingService": 2,
    "ratingBusiness": 4,
    "ratingValue": 3,
    "segmentLabels": [
      {
        "OTHER": "n"
      },
      {},
      {
        "OTHER": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "p"
      },
      {
        "ROOMS": "x"
      },
      {
        "ROOMS": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "ROOMS": "x"
      },
      {
        "OTHER": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "FOOD": "n"
      },
      {
        "VALUE": "n"
      },
      {
        "FOOD": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "OTHER": "n"
      }
    ],
    "date": "Nov 2, 2007",
    "ratingCheckin": 3,
    "segments": [
      "Declining standards Stayed at this hotel on 3 seperate occasions, and standards keep slipping.",
      "First time:",
      "Dec 24-26 2004Was very pleased with the sea-facing deluxe room with a balcony.",
      "Room was small (but the rooms here all are), furniture was new, and the balcony was fantastic.",
      "This was the time of the asian tsunami.",
      "Hotel was still managed by the Meridien chain then, and standards were pretty good.",
      "Second time: mid-2005Booked a room on the club floor, hoping to get a room similar to my last visit.",
      "Pleasantly surprised when given a large corner room, racing the greenery with sitting area.",
      "Breakfast and tea at the club lounge was good too, as was the italian restaurant on the roof La Cantina.",
      "Gym was wonderful too.Vowed to return.",
      "Third and last time: Dec 2005Booked a club room again.",
      "Absolute disaster after hotel stopped being called Changi Meridien.",
      "First, paid premium for club floor only to find out that the lounge was closed.",
      "Second, breakfast at the coffeehouse at the lobby was horrid, having no seats as the place was full of screaming kids and families.",
      "It made me wonder why i bothered to pay extra in the first place.",
      "Third, cocktails at the lounge downstairs were a joke.",
      "FInally, the room was just a standard room and I could see wear and tear.",
      "When I complained to the manager at the end of my stay, he just shrugged his shoulders and told me to write in formally.",
      "What nonsense.I will never stay there again."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 2,
    "ratingRoom": -1,
    "author": "A TripAdvisor Member",
    "hotelId": "109379",
    "reviewId": "109379:31",
    "ratingLocation": -1,
    "ratingCleanliness": -1,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": -1,
    "segmentLabels": [
      {},
      {},
      {
        "OTHER": "x"
      },
      {
        "CHECKIN": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "SERVICE": "n",
        "VALUE": "n"
      }
    ],
    "date": "Jun 25, 2003",
    "ratingCheckin": -1,
    "segments": [
      "Sterling Hotel We stayed at Sterling",
      "Hotel the night of 6-20-03.",
      "We had made a prior reservation 5 days before-hand, and confirmed the day before that we had paid for and would stay in an Upgraded 1 King room.",
      "It took us approximately an hour to FINALLY get the room we had originally reserved and pre-paid for...when we should've originally had it when we walked through the door.",
      "What we did get at first was a Standard (non-upgraded) 1 Double (small/handicap) room.",
      "By this time, it was a Friday night, we had traveled half the day, hungry, tired, and late for a party.",
      "We felt rushed, and it made both of us in a frustrated mood until the party (and even after, when thinking about it).",
      "When we called for more towels and shampoo, I had to call back 2-3 times and nearly an hour to finally bring us more towels, because we had to take a shower/bath before our party that we were then late for!",
      "And when I called, the lady sounded bland and bothered.",
      "The towels finally came, but no shampoo (which came later).",
      "Ontop of all of this, NO ONE offered us any sort of compensation or restitution for the mix-up or long wait!!"
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": 4,
    "author": "andreas888",
    "hotelId": "276043",
    "reviewId": "276043:86",
    "ratingLocation": 5,
    "ratingCleanliness": 5,
    "ratingService": 5,
    "ratingBusiness": 5,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "OTHER": "p",
        "VALUE": "p"
      },
      {},
      {
        "OTHER": "p"
      },
      {
        "LOCATION": "p"
      },
      {
        "BUILDING": "p",
        "SERVICE": "p"
      },
      {
        "BUILDING": "p"
      },
      {
        "SERVICE": "p"
      }
    ],
    "date": "Feb 16, 2007",
    "ratingCheckin": 4,
    "segments": [
      "One of Berlin's best value premium hotels",
      "As a frequent traveller, I'm quite particular hotels.",
      "So when I say that this is a great hotel, that means something.",
      "In terms of tourism, it's well situated, only a 5 min walk from the Brandenburg Gate.",
      "It's very well run and has a good fitness area.",
      "Very good Feng Shui layout, contemporary but not elegant.",
      "Great value for the money."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": -1,
    "author": "A TripAdvisor Member  <Content>Paradise....",
    "hotelId": "218524",
    "reviewId": "218524:2517",
    "ratingLocation": -1,
    "ratingCleanliness": -1,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": -1,
    "segmentLabels": [
      {
        "OTHER": "ip"
      },
      {
        "OTHER": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "CHECKIN": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "FOOD": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "OTHER": "x"
      }
    ],
    "date": "Jul 29, 2003",
    "ratingCheckin": -1,
    "segments": [
      "My husband and I spent a wonderful vacation from July 20th - July 28th.",
      "We have only great things to say about this resort.",
      "Everyone is very friendly, helpful and always willing to put a smile on your face.",
      "We speak the language and of course is always a plus.",
      "Our flight on USA 3000 was great, we arrived on time at the airport and were taken to the bus without any problem.",
      "The ride was a little bumpy but it's part of the whole adventure!",
      "Some of the other reviews mentioned the poverty and small wooden homes, o.k. you're there for the resort not to stay at peoples homes!",
      "Anyhow, we arrived at Secrets and were greeted with Mimosa and a smooth check-in.",
      "We immediately had lunch in the Mediteranian restaurant, great shrimp!!",
      "Some great tips would be to book everything right away.",
      "Horseback riding, photographer, we didn't do either and regret it!",
      "I highly recommend taking the pictures, I saw some of the couples fotos and were awesome!!",
      "The week we stayed there they made the French restaurant into a first come - first serve basis, so try and get there around 6:30 or 7:00 and you'll be guaranteed a table.",
      "Overall the food was excellent, both my husband and I gained about 10 lbs with all the food and great drinks they served.",
      "Benjamin one of the bar tenders is awsome!!!",
      "He's always talking, laughing, cracking jokes and very humble.",
      "Nicolas the front desk manager is very helpful and always willing to go out of his way to get what you need.",
      "We took bug spray but was taken out of our luggage at the airport, thank god the staff was spraying for the beach dinner or else we would have been eaten alive!!! Highly recommend tipping, these people work very hard and don't get a good salary so tipping is good and makes you feel happy that you'll helping someone who is willing to do anything to make your stay at Secrets a memorable one!"
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": 5,
    "author": "Savannah20",
    "hotelId": "595373",
    "reviewId": "595373:65",
    "ratingLocation": 4,
    "ratingCleanliness": 5,
    "ratingService": 5,
    "ratingBusiness": 4,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {},
      {},
      {
        "BUILDING": "x"
      },
      {
        "SERVICE": "p"
      },
      {
        "BUILDING": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "ROOMS": "ip"
      },
      {
        "BUILDING": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "FOOD": "p"
      },
      {
        "LOCATION": "x"
      },
      {
        "OTHER": "p"
      }
    ],
    "date": "Nov 17, 2007",
    "ratingCheckin": 5,
    "segments": [
      "perfect !",
      "I heard about this hotel from a friend, and as",
      "I was in Boston last August, I choose the Westin Waterfront.",
      "The hotel seemed so big and more a business hotel (convention center just next door), but looking carefuly, a lot of families were staying there.",
      "Staff is professionnal and smily (bellman, front desk housekeeping ).",
      "Very lighty lobby (nice atrium) wooden and natural materials everywhere.",
      "I had a very comfortable room with a great view of Downtown Boston, huge bathroom, and fabulous sleeping in heavenly beds, specific to Westin !!",
      "also had a coffee maker with Starbucks in room.",
      "There is a fitness center and a nice indoor pool, which is very appreciated when you walked in town the whole day !",
      "I was visiting friends in Cambridge (opposite side of town), taxi drive is 15minutes from here and costs around $17/way.",
      "Downtown and Historic Boston is a 5-7 minute taxi drive, costs $8/way.",
      "I had breakfast buffet at restaurant Sauciety, simply delicious!",
      "So even if the Westin is situated south of Boston (as they said!),",
      "I would definitely go back there and recommand it to anybody."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 3,
    "ratingRoom": 4,
    "author": "shorty20",
    "hotelId": "284442",
    "reviewId": "284442:58",
    "ratingLocation": 2,
    "ratingCleanliness": 4,
    "ratingService": 4,
    "ratingBusiness": -1,
    "ratingValue": 3,
    "segmentLabels": [
      {
        "OTHER": "n"
      },
      {
        "BUILDING": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "ROOMS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "n"
      },
      {
        "FOOD": "n"
      },
      {
        "FOOD": "p"
      },
      {
        "OTHER": "p",
        "LOCATION": "n"
      }
    ],
    "date": "Jul 20, 2006",
    "ratingCheckin": 4,
    "segments": [
      "Not Bad, but not great either",
      "My husband and I spent 5 nights at the resort, and overall thought it was a nice place.",
      "The grounds were beautiul, and we had a great view from our room.",
      "The staff was very friendly and helpful.",
      "Our sink started leaking on the second day, and when we came back that night it was fixed.",
      "The AC was not working at the time, but they did provide a large fan, and since we only spent our nights there, it got cool enough where it wasn't an issue.",
      "The restaurant service was very slow, however.",
      "On our first night there was a buffet, so we could start eating right away, and the food was wonderful.",
      "The last night of our stay, however, was a different story.",
      "We ordered off of the menu and it took an extremely long time for our food to come, and the place was not busy at all.",
      "The food was good however, when it finally did arrive.I believe on our next trip we will stay either on the North Shore, or near Waikiki, just to be closer to everything.",
      "Overall, not a bad place, but a little too far from all the excitement."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 2,
    "ratingRoom": 1,
    "author": "sirmeone",
    "hotelId": "190616",
    "reviewId": "190616:94",
    "ratingLocation": 4,
    "ratingCleanliness": 3,
    "ratingService": 3,
    "ratingBusiness": 1,
    "ratingValue": 2,
    "segmentLabels": [
      {
        "OTHER": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "VALUE": "n"
      },
      {
        "OTHER": "n",
        "LOCATION": "p"
      }
    ],
    "date": "Jan 9, 2007",
    "ratingCheckin": 5,
    "segments": [
      "Do Not Recommend this Hotel",
      "The room was at the back of the hotel and did not get any natural light from the outside.",
      "The beds were so sunken that it was impossible to sleep on them.",
      "These are the worst beds that we have seen in any hotel of this rating.",
      "Concierge presence was sporadic but the reception staff were quite helpful.",
      "The final bill contained some incorrect charges,so check your bills carefully.",
      "The hotel is overpriced.",
      "We will not stay there again even though it is in a good location."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": 4,
    "author": "JohnMH",
    "hotelId": "307332",
    "reviewId": "307332:51",
    "ratingLocation": 5,
    "ratingCleanliness": 5,
    "ratingService": 4,
    "ratingBusiness": -1,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "OTHER": "p",
        "LOCATION": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "p",
        "LOCATION": "p"
      },
      {
        "LOCATION": "ip"
      },
      {
        "LOCATION": "x"
      },
      {
        "LOCATION": "p"
      },
      {
        "LOCATION": "p"
      },
      {
        "BUILDING": "p",
        "ROOMS": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "VALUE": "p"
      },
      {
        "LOCATION": "in"
      }
    ],
    "date": "Aug 23, 2006",
    "ratingCheckin": 5,
    "segments": [
      "Very good hotel in a great location",
      "My wife and I stayed at the Dia-Ichi Hotel Tokyo during the last week of July 2006.",
      "I would just like to echo what some of the other reviewers have mentioned, particularly the quality of the hotel and its great location.",
      "The Dai-Ichi Hotel Tokyo is across the street from the Shimbashi train station (there is actually an underground connection), which in addition to a couple of subway lines also has the Yamanote JR train line which is great for getting to the various sights (the Yamanote line is a circle line that runs around central Tokyo and is covered by the JR rail pass).",
      "This means that if you are coming in from Narita airport all your have to do is take the Narita Express to Tokyo Station and then get on the Yamanote line and travel two stops to Shimbashi.",
      "In addition to great transportation, there are also numerous restaurants and coffee shops in the surrounding streets, including a full supermarket in the Shimbashi station.",
      "As has also been mentioned, the hotel is only a 15 minute walk to the fish market which is very handy as the action there starts before the subway begin operation in the morning.",
      "The hotel itself was very nice; equivalent to a 4-star business hotel in North America with well appointed and relatively spacious rooms.",
      "The staff were very helpful and there always seemed to be at least one staff member available at all time who spoke English.",
      "We got a very good price for this hotel on Expedia (CAD$160/night) - a price/quality combination that we would be hard pressed to match in any North American hotel.",
      "The only word of caution would be directed towards very light sleepers as the hotel is next to the train tracks and at times some noise can filter through to the room."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": 5,
    "author": "glbtrttr",
    "hotelId": "112179",
    "reviewId": "112179:31",
    "ratingLocation": -1,
    "ratingCleanliness": 5,
    "ratingService": 5,
    "ratingBusiness": -1,
    "ratingValue": 5,
    "segmentLabels": [
      {},
      {
        "CLEANLINESS": "p",
        "CHECKIN": "p",
        "OTHER": "p",
        "ROOMS": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "BUSINESS": "n"
      },
      {
        "LOCATION": "p"
      },
      {
        "VALUE": "in"
      },
      {
        "OTHER": "x"
      }
    ],
    "date": "May 28, 2006",
    "ratingCheckin": -1,
    "segments": [
      "Yup, It's a",
      "Ritz (except the fitness center) Have stayed in Ritz/Four Seasons properties in several cities and this one followed in line; prompt service, individualized welcome card upon check-in (not that I need that kind of thing), clean, comfortable room and beds - and the requisite Ferraris, Porshes and Escalades parked front and center with the valet.",
      "We had a ton of luggage including musical equipment, and the bellhops were attentive and luggage was in our room less than 10 mins after check-in.",
      "Was a little disappointed in the fitness center - more along the lines of something you'd find at a Hyatt, but still decent.",
      "Close to shops, etc.",
      "Still ticks me off that the Ritz and other 4/5 star hotels charge an extra $10 for internet access, but guess most are just expensing it through on business accounts anyway, but just include it in the room rate - I can get free access at Best Westerns!!!",
      "Overall, you'll definitely know it's a Ritz."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": 4,
    "author": "caneshockey31",
    "hotelId": "81038",
    "reviewId": "81038:37",
    "ratingLocation": 5,
    "ratingCleanliness": 5,
    "ratingService": 5,
    "ratingBusiness": 5,
    "ratingValue": 4,
    "segmentLabels": [
      {
        "OTHER": "p",
        "LOCATION": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "LOCATION": "x"
      },
      {
        "LOCATION": "ip"
      },
      {
        "ROOMS": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "SERVICE": "ip"
      },
      {
        "SERVICE": "p"
      },
      {
        "OTHER": "x"
      },
      {
        "NOTRELATED": "x"
      }
    ],
    "date": "Jun 24, 2008",
    "ratingCheckin": 5,
    "segments": [
      "Good Stay and Great Views",
      "This hotel was highly anticipated since we were booked in a King Size Balcony Room on the Top Floor (27th floor)The views can't be beat, very nice to be able to see the Golden Gate all they way around to the Bay Bridge.",
      "Hotel is located about 6 blocks from Embracadero and about 1.25 miles to Fisherman's Wharf.",
      "Located one block from Pure Chinatown Experience.",
      "Room was nicely appointed in Room 2701 and the Concierge Lounge access is on the 26th floor.",
      "Bathroom is a little small but the bed was very comfortable and the balcony with 2 chairs and a table were nice.",
      "Only one minor hiccup but it was rectified very quickly and without mentioning.",
      "Concierge and Front Desk and Bellman were very friendly and outgoing.",
      "Sedan and Limo Service is available from hotel from which we took a day trip to Monterrey (2 hours away) for a day visit.",
      "Never used restaurant, since we ate out each time to experience the real food of the West and Chinatown."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": -1,
    "author": "A TripAdvisor Member",
    "hotelId": "111983",
    "reviewId": "111983:100",
    "ratingLocation": -1,
    "ratingCleanliness": -1,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": -1,
    "segmentLabels": [
      {
        "ROOMS": "p",
        "SERVICE": "p"
      },
      {
        "BUILDING": "n"
      },
      {
        "BUILDING": "n"
      },
      {
        "ROOMS": "p"
      }
    ],
    "date": "Aug 21, 2004",
    "ratingCheckin": -1,
    "segments": [
      "Lovely Room Lovely room, very attentive staff from front desk to housekeeping to room service.",
      "3 nite stay in mid-July (oh so hot) and truly there simply not enough pool chairs.",
      "Yes it looks like the photo of the pool was taken with photographer on his back, but five lounge chairs and six arm chairs isn't enough on a hot Saturday afternoon after touring the city, with no place to sit.",
      "Otherwise, room had very comfy beds, lots of towels, room amenities replenished and the room AC works great!!"
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 1,
    "ratingRoom": 1,
    "author": "gingerwife",
    "hotelId": "81042",
    "reviewId": "81042:147",
    "ratingLocation": -1,
    "ratingCleanliness": 3,
    "ratingService": 2,
    "ratingBusiness": -1,
    "ratingValue": 1,
    "segmentLabels": [
      {
        "OTHER": "n"
      },
      {
        "OTHER": "n",
        "LOCATION": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "BUILDING": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "FOOD": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      }
    ],
    "date": "Jun 25, 2006",
    "ratingCheckin": -1,
    "segments": [
      "Awful - don't stay here!",
      "Two things: firstly, Fisherman's Wharf is a really bad location to stay in, in San Francisco - none of the best restaurants are in the immediate area, and Fisherman's Wharf itself is a tacky tourist trap (even San Fran residents are embarassed about it).",
      "Secondly, if you must stay here, the Holiday Inn is dire and should be avoided.",
      "On arrival, we were given a room in the beach block (which is a 5 minute walk from reception and nowhere near the waterfront!).",
      "The room was already occupied and someone's clothes were sill in the room.",
      "On our second attempt, the room we were given was dark, gloomy, a little shabby and overlooked the carpark - albeit it had a large TV and clean bathroom.",
      "The swimming pool is small and next to the main road - not worth booking the hotel for this perk.",
      "When we checked out, it took a twenty minute wait as the reception staff were clearly overworked and underpaid.",
      "Food: the main eating place in the Holiday Inn is a Denny's - a real crime to eat in this chain when there are so many excellent one-off places throughout the city (e.g. Mama's near Washington Square for brunch, Tomasso's in the North Beach for dinner).",
      "There was nothing more depressing than walking past a load of overweight people shovelling processed meat into their mouths every morning.",
      "I guess they couldn't be bothered to walk to the better places, as there are none in the immediate area.",
      "In terms of location, the Holiday Inn is convenient for the boats to Alcatraz - but that's about it.",
      "You are better off staying in the Nob Hill/Russian Hill area which is much closer to good restaurants, the Haight, Castro, Union Square, Golden Gate Park, the Ferry Building etc.",
      "We also stayed in the Carlton Hotel during our vacation, and this was excellent value - nicely decorated room, friendly and efficient staff, convenient location - and most importantly - no Denny's!"
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": 4,
    "author": "misterniz",
    "hotelId": "558796",
    "reviewId": "558796:190",
    "ratingLocation": 4,
    "ratingCleanliness": 5,
    "ratingService": 4,
    "ratingBusiness": -1,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "BUILDING": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "ip"
      }
    ],
    "date": "Sep 14, 2007",
    "ratingCheckin": 5,
    "segments": [
      "effortless class Only 3 mins stroll from the scrum of the",
      "Rialto, here is another world, calm and still.",
      "From the brass bell and massive wrought iron gate that open onto the small courtyard, through to all the details of the public areas and rooms, there is an impression of care and attention which must be down to the personal taste and presiding interest of the owners.",
      "Don't expect fawning service or overblown breakfasts - this is a place for adults to be treated as such.",
      "We usually check out other hotels in town for future reference - in Venice we just didn't bother."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 1,
    "ratingRoom": 2,
    "author": "Sunny-BCN",
    "hotelId": "483700",
    "reviewId": "483700:25",
    "ratingLocation": -1,
    "ratingCleanliness": 2,
    "ratingService": 1,
    "ratingBusiness": -1,
    "ratingValue": 1,
    "segmentLabels": [
      {
        "OTHER": "n"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "in"
      },
      {
        "BUILDING": "p",
        "SERVICE": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "FOOD": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "OTHER": "in"
      },
      {
        "OTHER": "n"
      }
    ],
    "date": "Mar 14, 2005",
    "ratingCheckin": -1,
    "segments": [
      "Worst place to stay in Barcelona",
      "I麓ve been to Barcelona many times, usually stay in the city center but this time I decided to try this newly builded Hotel.",
      "Big mistake.",
      "Altought the Hotel is nice, the staff is higly unattentive and unpolite.",
      "Specially front house staff which were extremly unhelpful.",
      "Breakfeast was not good either.",
      "I dont know haw can they claim to be a four star hotel.",
      "The other good point is that no one in the city knows where this Hotel is, therefore if you want to take a taxi there you have to give directions.",
      "I wouldnt recommend this place at all."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": 5,
    "author": "Worldtraveller076",
    "hotelId": "257287",
    "reviewId": "257287:16",
    "ratingLocation": 5,
    "ratingCleanliness": 5,
    "ratingService": 5,
    "ratingBusiness": 4,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "OTHER": "p",
        "LOCATION": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "LOCATION": "p"
      },
      {
        "FOOD": "p",
        "ROOMS": "p"
      },
      {
        "OTHER": "p"
      }
    ],
    "date": "Oct 10, 2007",
    "ratingCheckin": 5,
    "segments": [
      "Awesome Location Definately recommend this place.",
      "I stayed here and had a great time.",
      "The location was unbeatable, short ferry trip to the city and fantastic walks close by.",
      "The room met our needs and the breakfast was a great inclusion.",
      "I will definately stay here again, next time I will try the King Spa suite."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": 5,
    "author": "ket6969",
    "hotelId": "269966",
    "reviewId": "269966:19",
    "ratingLocation": 5,
    "ratingCleanliness": 5,
    "ratingService": 5,
    "ratingBusiness": 5,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "p"
      },
      {
        "LOCATION": "p"
      },
      {
        "CHECKIN": "ip"
      },
      {
        "BUILDING": "p",
        "ROOMS": "p"
      },
      {
        "CLEANLINESS": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      }
    ],
    "date": "Oct 19, 2008",
    "ratingCheckin": 5,
    "segments": [
      "Absolutely charming hotel",
      "I arranged this trip to Paris as a suprise for my partners 50th birthday.",
      "Because of the occasion I wanted this stay to be really special and thanks to the feedback from previous guests I selected this charming hotel and was not let down.",
      "The location is perfect as it is quiet but walking distance to many of the top attractions Paris as to offer.",
      "From the moment we checked in we knew this was going to be a trip to remember, we sat at the bar and sipped on perfectly chilled champagne whilst the hotel offered unbiased advice on nearby restaurants, bars etc.",
      "The actual hotel is fantastic, rooms our a good size for Paris, well designed, fabulous decorations and well maintained.",
      "In addition the housekeeping was excellent.",
      "Unfortunately due to unforseen circumstances we had to cut short our trip at short notice, well after the room had been serviced that day.",
      "The hotel were fantastic and helpful and waived there normal 48 hours notice cancellaton fee for our last night, thankyou.",
      "We will definately return."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": -1,
    "author": "barfood",
    "hotelId": "120821",
    "reviewId": "120821:15",
    "ratingLocation": -1,
    "ratingCleanliness": -1,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": -1,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "CLEANLINESS": "p",
        "ROOMS": "p",
        "SERVICE": "p"
      },
      {
        "LOCATION": "n"
      },
      {
        "OTHER": "p"
      }
    ],
    "date": "Jul 18, 2007",
    "ratingCheckin": -1,
    "segments": [
      "Loved the Days Inn!",
      "We stayed at the Days Inn in Metairie and had the most wondeful time.",
      "The rooms were very clean and the people could not have been more friendly.",
      "It was just a little outside New Orleans so the rates were great and the commute to all the fun was close.",
      "We can't wait to go back!!!"
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": 5,
    "author": "tomfortmann",
    "hotelId": "233494",
    "reviewId": "233494:25",
    "ratingLocation": 5,
    "ratingCleanliness": 5,
    "ratingService": 5,
    "ratingBusiness": 3,
    "ratingValue": 4,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "LOCATION": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "BUILDING": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "OTHER": "p"
      }
    ],
    "date": "Mar 2, 2007",
    "ratingCheckin": 5,
    "segments": [
      "The Palazzo is truly palatial!",
      "We spent three delightful nights at the luxurious Palazzo Magnani Feroni while visiting our son in Florence.",
      "Some friends from elsewhere in Italy joined us for one night, staying in another suite.",
      "We never needed a car, since all the attractions of Florence are just across the bridge within easy walking distance.",
      "The suites at the Palazzo are huge, lavishly decorated with period artwork, and extremely comfortable.",
      "The staff are friendly, English-speaking, and very helpful in making restaurant and train reservations for us.",
      "A nice touch was the International Herald Tribune the we found hanging on our doorknob each morning.",
      "Upstairs is a grand dining room where a sumptuous breakfast is served, and drinks are available there all evening.",
      "The 'piece de resistance' is the covered terrace on the roof with stunning views in all directions.",
      "We enjoyed it even in February, and in warmer weather drinks are served there during the evening hours.",
      "We recommend this magnificent hotel unequivocally to anyone seeking style, comfort, and luxury in the heart of Florence."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": 4,
    "author": "LeeRN123",
    "hotelId": "584407",
    "reviewId": "584407:621",
    "ratingLocation": 4,
    "ratingCleanliness": 5,
    "ratingService": 5,
    "ratingBusiness": -1,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "BUILDING": "p",
        "CLEANLINESS": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "ip"
      },
      {
        "OTHER": "ip"
      },
      {
        "ROOMS": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "SERVICE": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "NOTRELATED": "x"
      }
    ],
    "date": "Oct 8, 2006",
    "ratingCheckin": 5,
    "segments": [
      "I wanted to stay and live here forever",
      "I have been reading the reviews here a long time and went to the resort with mixed feelings and lots of things, like my own face cloths, toilet paper, benadryl, motrin, lomotil, sunscreen, sunburn cream with aloe and lots of batteries and toothpaste.",
      "We needed the lomotil at the end and the sunscreen and sunburn cream but the rest could have stayed home.",
      "We loved everything.",
      "The lomotil incident was my own fault.",
      "We went to the Saona Island excursion and had lunch on the beach and ate the salad.",
      "I think that is where we went wrong.",
      "Hubby got sick the next day and I the following.",
      "The resort is clean, the ocean is beautiful, the pools are wonderful.",
      "All the workers are friendly, but a little Spanish helps!",
      "I had my hair braided.",
      "I wanted braids from the part in my hair down and wound up with corn rows.",
      "Not bad, in fact, it looked cute.",
      "But it wouldn't have happened had I remembered more of my high school Spanish.",
      "The dinner at El Bucanero on the beach was the best!",
      "We had two Carribean lobster, shrimp and conch in rice.",
      "It was wonderful.",
      "And romantic.",
      "We upgraded and had everything we asked for instantly.",
      "We had a problem with bugs but reported it and they sprayed EVERYTHING.",
      "Can't ask for more than that.",
      "There was low lighting in the room and I did take a humidity jar with scent from Bed, Bath and Beyond and it helped some with moisture.",
      "Just go, relax and enjoy.",
      "They serve you like you are a king (or queen) and they try to make it a pleasant vacation.",
      "They succeeded for us, and we cannot wait to return to Ocean Blue.",
      "Hola Senor, Hola Senora."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": 4,
    "author": "gargas",
    "hotelId": "287670",
    "reviewId": "287670:66",
    "ratingLocation": -1,
    "ratingCleanliness": 3,
    "ratingService": 4,
    "ratingBusiness": -1,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "NOTRELATED": "x"
      },
      {
        "CLEANLINESS": "n",
        "LOCATION": "p",
        "VALUE": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "OTHER": "ip"
      },
      {
        "NOTRELATED": "x"
      }
    ],
    "date": "Dec 14, 2005",
    "ratingCheckin": -1,
    "segments": [
      "3rd Visit in 18 months",
      "Yes, the bathrooms smell - though I think it's less due to lack of cleanliness and more due to a lack of ventilation - and yes there's a bit of noise from the uncarpeted hallways and streets outside, but the location is unparalleled, and the price is unbeatable.",
      "While you don't get amenities like room service or laundry, you do get a very helpful staff and all the bottled water you can drink.",
      "And, for not too much more money, the suites are huge with nicer bathrooms - though they are in buildings separate from the main hotel.",
      "I'll go back for a 4th trip.",
      "The only thing I'd change would be giving out a set of earplugs with each room - we brought our own and it makes all the differnce in the world."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": -1,
    "author": "A TripAdvisor Member",
    "hotelId": "81126",
    "reviewId": "81126:103",
    "ratingLocation": -1,
    "ratingCleanliness": -1,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": -1,
    "segmentLabels": [
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "BUSINESS": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      }
    ],
    "date": "Aug 11, 2005",
    "ratingCheckin": -1,
    "segments": [
      "The Fog can block your view!",
      "Great hotel but don't bank on a good view all the time.",
      "We were in S.F. in August (Fog Season) and could not see the street from 38 floors up... not to mention ever seeing the bay.",
      "If you have an expectation of having a great view just cause you are on floor 38-48... just be ware.",
      "Otherwise, there are reasons this is regarded as one of the best in the world!",
      "Good look"
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": 5,
    "author": "jkandethan27",
    "hotelId": "259593",
    "reviewId": "259593:2",
    "ratingLocation": 5,
    "ratingCleanliness": 5,
    "ratingService": 5,
    "ratingBusiness": 5,
    "ratingValue": 4,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "ip"
      },
      {
        "ROOMS": "p",
        "VALUE": "in"
      },
      {
        "VALUE": "in"
      },
      {
        "ROOMS": "x"
      },
      {
        "ROOMS": "p"
      },
      {
        "BUILDING": "p",
        "SERVICE": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "VALUE": "in"
      },
      {
        "OTHER": "p"
      }
    ],
    "date": "Dec 6, 2008",
    "ratingCheckin": 5,
    "segments": [
      "loved hotel zaza we found the best rate at hotels.",
      "com we booked a couple days before we left and only payed 118.00 per night which was for a deluxe parlor, which was very nice.",
      "we never stayed at a place like that.",
      "the room had some high end shaving cream and aftershave lotion, dont use it unless u want to pay 30 dollars a bottle.",
      "the fridge was fully stocked with stuff to make mix drinks ,which we did not touch because it was way high and the goody basket on top of the fridge ,a bag of chips or candy bar 4.00 , we left it alone.",
      "our room had a retro yet classic feel.",
      "plasma flat screen with marble bathroom floors and counters, nice shower, candles lit in room when we came in and average comfy bed.",
      "the place was decorated beautifully and the concierge was very helpful.",
      "The dragonfly restraunt was very expensive but tasty and i even seen two famous people , if my eyes did not deceive me. i am pretty for sure it was them.",
      "i am a small town girl so the urge to ask for a pic ate at me, and they did not tell us when we check in and never having stayed at a place that nice, we did not know, but they charge us 20 a day for valet parking.",
      "we would go back only if we received a great price."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": 5,
    "author": "Toton-traveller",
    "hotelId": "224856",
    "reviewId": "224856:6",
    "ratingLocation": 4,
    "ratingCleanliness": 5,
    "ratingService": -1,
    "ratingBusiness": 3,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "BUILDING": "p"
      },
      {
        "LOCATION": "p"
      },
      {
        "LOCATION": "x"
      },
      {
        "FOOD": "n"
      },
      {
        "SERVICE": "x"
      },
      {
        "ROOMS": "p"
      }
    ],
    "date": "Sep 10, 2008",
    "ratingCheckin": 5,
    "segments": [
      "Happy choice Stayed here for 5 nights in mid august with reward points.",
      "It was an unusual residence inn, looking more like an embassy suites internally, but the 2 bed suite we had was lovely, obviously newly renovated and really nicely furnished, plus great LCD TV's.",
      "The hotel is in a nice location looking over Lake Union, and not too far from the centre of Seattle, (long walk or short drive).",
      "The hotel is on a busy corner and road noise was sometimes very obvious but wouldn't put me off staying again.",
      "The breakfast area was very busy and seemed too small really to cope with the number of people grabbing their free grub.",
      "There was only one 'managers reception' rather than the usual mon-thurs.",
      "No matter, the suites were really comfortable and homey and we enjoyed our stay despite the small shortcomings."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": 5,
    "author": "TNtravelers02",
    "hotelId": "218524",
    "reviewId": "218524:1496",
    "ratingLocation": -1,
    "ratingCleanliness": 5,
    "ratingService": 5,
    "ratingBusiness": -1,
    "ratingValue": 4,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "CLEANLINESS": "p",
        "ROOMS": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "x"
      },
      {
        "SERVICE": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "OTHER": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "SERVICE": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "x"
      },
      {
        "OTHER": "p"
      }
    ],
    "date": "Jul 2, 2006",
    "ratingCheckin": -1,
    "segments": [
      "Great Vacation for Relaxing!",
      "We vacationed with another couple June 24-July 1 at Secrets Excellence and had a great time.",
      "The pool is very large and we liked it because there were areas of the pool used by the entertainment staff and separate areas that were so quiet you couldn't even hear the entertainment and music.",
      "Our room was very nice and extremely clean.",
      "We never saw any bugs in our room at all.",
      "It was one of only a few garden view rooms that is actually a garden view instead of an a view of an air conditioning unit or something like I have found at other resorts.",
      "The food was ok, but nothing spectacular.",
      "We really enjoyed the Mexican restaurant the best although the wait for the food there was the longest.",
      "It is your basic all-inclusive food package, although we've had worse at other resorts.",
      "We never had problems getting into any of the restaurants as far as wait time or anything like that.",
      "The service is spectacular, from the front desk to the waitstaff to the housekeeping.",
      "The people there definitely make it easy to enjoy yourself.",
      "We did not go on any excursions because they all seemed to include really long bus rides.",
      "The bus ride on the way in is long and bumpy, but not as bad as roads in Jamaica.",
      "At least they were paved!!",
      "Do take bug spray!!",
      "The first couple of nights the mosquitos were no problem, but towards the end of the week we were all wearing jeans because the mosquitoes were out of control.",
      "We all had a lot of bites even with bug spray!!",
      "My friend and I both had spa treatments.",
      "We each bought a package that included a bodyscrub, wrap and 50 minute massage.",
      "Mine was $140usd and hers was $190usd because she added an manicure/pedicure.",
      "This was by far the most relaxing and most wonderful part of my week.",
      "With their great service and wonderful prices, I would recommend at least one trip to the spa to everyone!",
      "This is a very laid back resort and I think it's great for people like us who wanted the ease of an all-inclusive.",
      "If you're looking for tons of things to do besides sit and relax at the beach or pool, this may not be ideal for you.",
      "We thought it was perfect for people like us who wanted to do nothing other than relax!"
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 3,
    "ratingRoom": 4,
    "author": "Yamster",
    "hotelId": "152467",
    "reviewId": "152467:0",
    "ratingLocation": 5,
    "ratingCleanliness": 4,
    "ratingService": -1,
    "ratingBusiness": 4,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "BUSINESS": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "LOCATION": "p"
      },
      {
        "CLEANLINESS": "p",
        "ROOMS": "x"
      },
      {
        "SERVICE": "x"
      },
      {
        "VALUE": "p"
      }
    ],
    "date": "Jun 28, 2008",
    "ratingCheckin": 4,
    "segments": [
      "Satisfactory business hotel",
      "I was in Mexico City for work for two nights, and I got a corporate rate through the organization I was working with (around US$90/night).",
      "The hotel is in a convenient location as far as accessing public transportation.",
      "My room was clean and given that I spent so little time in it, it was perfectly adequate while not being anything special.",
      "I'm a fluent Spanish speaker and I used to live in DF, so I really didn't need to rely on hotel staff for anything, so I can't comment on service.",
      "For the price I paid, I have no complaints."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 2,
    "ratingRoom": 2,
    "author": "A TripAdvisor Member",
    "hotelId": "258639",
    "reviewId": "258639:53",
    "ratingLocation": -1,
    "ratingCleanliness": 3,
    "ratingService": 3,
    "ratingBusiness": -1,
    "ratingValue": 3,
    "segmentLabels": [
      {
        "OTHER": "x"
      },
      {
        "CLEANLINESS": "n"
      },
      {
        "CLEANLINESS": "n"
      },
      {
        "FOOD": "p",
        "SERVICE": "p"
      },
      {
        "ROOMS": "x"
      },
      {
        "BUILDING": "p"
      }
    ],
    "date": "May 18, 2005",
    "ratingCheckin": -1,
    "segments": [
      "ok but not great",
      "As per someone elses view the carpets were shabby shabby shabby, they had a scent.",
      "The top sheet on the beds are not changed when the room is relet. so it means we were induldging in someone elses sweat we had to request the change after noticing dried bits on the bedspread, however the sheets were changed everyday.",
      "The staff are nice and the breakfast was fine too.",
      "Is ok if you just need a room but not ok if you want to chillout in and watch telly all day.",
      "The hotel spacing was large and the bathroom was nice recently refurbished, this was the best feature."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": -1,
    "author": "aussiemumGoldCoast",
    "hotelId": "77270",
    "reviewId": "77270:68",
    "ratingLocation": -1,
    "ratingCleanliness": -1,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": -1,
    "segmentLabels": [
      {
        "VALUE": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "CLEANLINESS": "p",
        "SERVICE": "p",
        "ROOMS": "p",
        "VALUE": "p",
        "LOCATION": "p"
      },
      {
        "VALUE": "x"
      },
      {
        "LOCATION": "ip",
        "NOTRELATED": "x"
      },
      {
        "OTHER": "n"
      }
    ],
    "date": "Nov 8, 2007",
    "ratingCheckin": -1,
    "segments": [
      "good value My 10 year old daughter and",
      "I had a 3 day stopover in Hollywood and stayed and the Orchid Suites.",
      "I found the staff excellent, very helpful, you cannot get a better location for this money, and for the price, very clean and large rooms, complete with kitchens, so you can save on meal expenses.",
      "The staff will book your tours, and Hollywood and Highland Shopping Complex is literally a stones through away.",
      "Very safe part of Hollywood, and highly recommended for families.",
      "The only downside is it is a bit noisey and not great views."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": 3,
    "author": "mmbustillo",
    "hotelId": "119650",
    "reviewId": "119650:64",
    "ratingLocation": -1,
    "ratingCleanliness": 3,
    "ratingService": 5,
    "ratingBusiness": -1,
    "ratingValue": 4,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "OTHER": "x"
      },
      {
        "CLEANLINESS": "p",
        "OTHER": "p",
        "LOCATION": "p",
        "SERVICE": "p",
        "ROOMS": "p"
      },
      {
        "FOOD": "n",
        "LOCATION": "n",
        "ROOMS": "n"
      }
    ],
    "date": "Aug 4, 2005",
    "ratingCheckin": -1,
    "segments": [
      "pleasant stay Our family of four just returned from San",
      "Francisco and we stayed at the Francisco Bay Inn.",
      "Pros: clean room, fridge and micro, roomy bathroom, walking distance to Fisherman's Wharf, two blocks from public transportation, friendly staff, free parking, reasonable rates.",
      "Cons: noisy street, small room for a family, no closet, limited continental breakfast."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 1,
    "ratingRoom": 1,
    "author": "Kia0",
    "hotelId": "249328",
    "reviewId": "249328:57",
    "ratingLocation": -1,
    "ratingCleanliness": 1,
    "ratingService": 1,
    "ratingBusiness": -1,
    "ratingValue": 1,
    "segmentLabels": [
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "CLEANLINESS": "n"
      },
      {
        "FOOD": "n"
      },
      {
        "FOOD": "n",
        "VALUE": "n"
      },
      {
        "FOOD": "n"
      },
      {
        "FOOD": "n"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "n"
      },
      {
        "FOOD": "n",
        "SERVICE": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "CLEANLINESS": "n",
        "OTHER": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "NOTRELATED": "x"
      }
    ],
    "date": "Jan 18, 2006",
    "ratingCheckin": -1,
    "segments": [
      "A romantic weekend in Amsterdam",
      "Extremely basic!!!",
      "Asked for a room near to reception which we did get but up a flight of extremely steep stairs.",
      "No offer of help with our bags from staff member who was too busy chatting on MSN to concentrate on booking us in.Vending machines in reception, empty and don't work!!!",
      "Half the light bulbs didn't work, windows wouldn't shut.",
      "Laminate floorboards kept moving.",
      "Strange looking brown bugs everywhere in room.",
      "Food disgusting!",
      "We were persuaded to eat in the restaurant downstairs the first night we were there, tasteless colourless small extortionately expensive portions.",
      "Then go to breakfast that's an experience!!!",
      "A table is laid out with ham and cheese, stale bread rolls and a large bowl of cereals.",
      "Cooked breakfast is available as an extra.",
      "Tea and coffee is available, but it is not offered, you have to seek it out for yourself.",
      "Staff surly, refuse to serve you, had some waiter click his fingers at me to let me know my tea was ready.",
      "To top it all, we both came out in a rash that we assumed was an allergic reaction to something, it started on our wrists and spread over our bodies.",
      "Imagine how mortified we were when consulted a doctor to discover that we had SCABIES!!!!",
      "The doctor said it could be caught from dirty beds or bedding.",
      "Under no circumstances would we recommend this hotel to anybody.",
      "This being said, Amsterdam is a beautiful romantic city and it didn't detract from the enjoyment we derived from our stay."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 1,
    "ratingRoom": -1,
    "author": "wreckdiver95",
    "hotelId": "218486",
    "reviewId": "218486:210",
    "ratingLocation": -1,
    "ratingCleanliness": -1,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": -1,
    "segmentLabels": [
      {
        "VALUE": "x"
      },
      {
        "OTHER": "in"
      },
      {
        "SERVICE": "in"
      },
      {
        "OTHER": "in"
      },
      {
        "OTHER": "in"
      },
      {
        "OTHER": "in"
      },
      {
        "CLEANLINESS": "n",
        "ROOMS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "OTHER": "n"
      }
    ],
    "date": "Jun 25, 2007",
    "ratingCheckin": -1,
    "segments": [
      "Save your money",
      "We just got back this past weekend and for the first time I have never been so happy to be home from vacation.",
      "The beach vendors spoke better english than the hotel employees.",
      "The two semesters of Spanish I took in college only got me so far.",
      "Had my boyfriend not been multi-lingual we would have had a real problem.",
      "When we asked for an iron, we were told they were all broken.",
      "One of the pipes broke and the whole outside of our bloque smelled like raw sewage for days.",
      "I lost count as to how many times we were without water and the night before we left, the hot water shut off in the middle of my shower.",
      "The bufftet was average.",
      "The meat looked a little suspicious but the rest of it was ok.",
      "The service was absolutely awful.",
      "I live in NY and have gone to both upscale restaurants as well as holes in the wall and have never seen such poor service.",
      "Most of the wait-staff was very pleasant, or so I assumed because I could not understand what they were saying.",
      "I think that they were just so understaffed that they did their best.",
      "The pools and beach were beautiful, the grounds well maintained, just lovely to look at but not someplace I would ever return to."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": 4,
    "author": "Bannerman-7",
    "hotelId": "305813",
    "reviewId": "305813:243",
    "ratingLocation": 3,
    "ratingCleanliness": 4,
    "ratingService": 2,
    "ratingBusiness": 4,
    "ratingValue": 3,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "CLEANLINESS": "p",
        "ROOMS": "p",
        "VALUE": "n"
      },
      {
        "VALUE": "n"
      },
      {
        "FOOD": "p",
        "VALUE": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "x"
      },
      {
        "CLEANLINESS": "n"
      },
      {
        "CLEANLINESS": "n",
        "OTHER": "p"
      }
    ],
    "date": "Nov 16, 2007",
    "ratingCheckin": 4,
    "segments": [
      "Nice hotel We stayed at Langham",
      "Place for 3 nights over a weekend and were pleased we chose this hotel.",
      "All the staff were very friendly and were happy to assist in any way they could.",
      "The room was modern and clean with a fantastic powerfull shower, however we found the room to be on the small side as we expected a larger one for the 鈧?",
      "10 p/n incl breakfast we paid.",
      "We dined in Ming Court on our first night and had a great meal, we were surprised at how reasonable the food cost when I recieved the bill.",
      "The Shopping Mall next door has a good selection of shops, cafes and restaurants and you can go there from the hotel via an enclosed walkway.",
      "We found the best shopping to be in Causeway Bay.",
      "If you dont want to use the subway station at the hotel a Taxi from hotel will cost HK$80 incl tip one way.We did not use the hotel spa or pool but they looked great when I went to have a look around.",
      "The Bar was busy and had some good live music and there was happy hour each evening between 18:30 20:30 where drinks were 2 for 1.Free Internet with 6 Laptops was available at a location near the bar and a large Flatscreen TV to keep you up to speed on World News and Sport.",
      "The only problem we had during our stay was coming back to our room in late afternoon to find the room had not been cleaned.",
      "Each morning we left the room at 09:30 and pressed a button to request room to be cleaned so it was dissapointing to find room not cleaned on our return.I mentioned this a checkout and even filled out a form so I hope this problem will be sorted out.We had a great time at Langham Place and would stay here again when I next visit Hong Kong."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": 5,
    "author": "puilam",
    "hotelId": "647813",
    "reviewId": "647813:10",
    "ratingLocation": 5,
    "ratingCleanliness": 5,
    "ratingService": 5,
    "ratingBusiness": 3,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "p"
      },
      {
        "LOCATION": "x",
        "ROOMS": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "CLEANLINESS": "p",
        "FOOD": "x",
        "ROOMS": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "SERVICE": "p",
        "NOTRELATED": "x"
      },
      {
        "OTHER": "ip"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "ROOMS": "n"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "x"
      }
    ],
    "date": "Sep 23, 2008",
    "ratingCheckin": 5,
    "segments": [
      "They've raised the bar!",
      "We are originally from Toronto and decided to stay in the entertainment district for a weekend of fun.",
      "We chose this hotel because it had the added full kitchen, and for a family, it's ideal.",
      "We chose the studio room and got one on the 14th floor with a fabulous view of the CN Tower.",
      "Well, the Marriott chain has outdone itself with this Residence Inn location.",
      "I believe it is newly built which is why the room is spotless and not showing any wear yet.Although the hot breakfast buffet is pretty standard fare you can't complain - complimentary breakfast is better than none.",
      "Everything about the room was amazing: upgraded lighting fixtures, super-comfy bed with high thread count sheets, granite (or something like granite) counters in the kitchen and bath, upgraded work desk and table, large bathroom, flat panel TV (that swivels almost 360 degrees), easy to control room temperature settings, nice kitchen appliances and kitchenware (not the cheap stuff).",
      "Super comfortable - truly a home away from home.",
      "We're used to less than stellar service from Torontonians in the service industry, but the staff here are friendly, well trained, and efficient.",
      "A total surprise for us!",
      "Maybe Toronto is changing its ways.",
      "The only complaint is the thin door and huge gap at the bottom of the door which makes any hallway noise seem like it's coming from your own room.",
      "I usually save 5 star ratings for very high end hotels but this one deserves it!",
      "Other notes:1) stay away from the buffet breakfast between 9-10am, it's like a zoo and can get very crowded2) the complimentary wi-fi service is good but slow at times3) parking is $30/night; but valet service is fast and friendly"
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 2,
    "ratingRoom": -1,
    "author": "A TripAdvisor Member",
    "hotelId": "478252",
    "reviewId": "478252:1791",
    "ratingLocation": -1,
    "ratingCleanliness": -1,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": -1,
    "segmentLabels": [
      {
        "OTHER": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "FOOD": "n"
      },
      {
        "FOOD": "n"
      },
      {
        "FOOD": "n"
      },
      {
        "FOOD": "n"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "SERVICE": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "SERVICE": "p"
      },
      {
        "ROOMS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      }
    ],
    "date": "Sep 13, 2004",
    "ratingCheckin": -1,
    "segments": [
      "US travelers beware Potentially Good",
      "Hotel, but US travelers - beware!!!",
      "1) The majority of the staff doesn't speak English, so you'll end up getting the wrong drinks at the bars and the wrong food at the a la carte restaurants.",
      "Drinks are BAD anyway- either missing alcohol or have the wrong ingredients altogether.",
      "Suggestion - order straight rum, you'll get more flavor.",
      "2) Don't bother making reservations to Japanese or French restaurants.",
      "Their food SUCKS.",
      "But the Steakhouse is worth trying!!",
      "However, their buffet (Orchidea ?)",
      "is the BEST. 3) Also, if you plan to use included (non-motorized) water sports, you'll have to wait for your boat 2-3 days and deal with a very rude and arrogant staff of Scuba Caribe (contractors for Bahia).",
      "When we complained to the resort about this, Guest Services were unable to remediate the situation.",
      "(I guess, being too new , they just don't realise that positive feedback is a rare commodity:)).",
      "4) Room service is great, if you leave your tips at the beggining of the trip and if you are good at sign laguage.",
      ":))On this note, fetch some beach towels to the room when you want to take a shower.",
      "The bathroom is designed the way that it gets flooded when you take a shower (no shower curtains), so you'll somehow need to contain all that water till the morining , when the cleaning lady comes in...Summary is - Beaches (Sandals ) is still the best among the Carribean all-inclusives.",
      "And Bahia is mostly oriented at the Europeans (who have min .",
      "25 days of vacation throughout the year, and can afford hotel's screw-ups)."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": 3,
    "author": "sb_tor",
    "hotelId": "80999",
    "reviewId": "80999:93",
    "ratingLocation": 5,
    "ratingCleanliness": 4,
    "ratingService": 3,
    "ratingBusiness": 4,
    "ratingValue": 4,
    "segmentLabels": [
      {
        "LOCATION": "p"
      },
      {
        "LOCATION": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "CHECKIN": "p"
      },
      {
        "ROOMS": "p"
      },
      {
        "SERVICE": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "VALUE": "n"
      },
      {
        "VALUE": "n"
      },
      {
        "VALUE": "n"
      },
      {
        "VALUE": "n"
      },
      {
        "SERVICE": "p",
        "VALUE": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "OTHER": "p",
        "LOCATION": "p"
      }
    ],
    "date": "Oct 3, 2007",
    "ratingCheckin": 5,
    "segments": [
      "Great Location Stayed here for 2 days.",
      "The location is great, just off union square.",
      "We booked through priceline, was not expecting much.",
      "However, the check-in person was quick, efficient and smiling, and gave us high floor with a view of union square.",
      "The room itself was fine without being grand.",
      "On another occasion, the reception was also able to change Canadian Dollars to US Dollars quickly, although they warned me that their rate is higher.",
      "Not a problem because I wanted only some change.",
      "Armed with reviews of this hotel, we made the right decision not to have a car during the stay.",
      "It is not needed.",
      "Took the BART train from the airport to the hotel.",
      "The MUNI Pass is a great way to see the city.",
      "While leaving, we walked to a car rental nearby and drove away to our next destination (San Jose).",
      "Be prepared to pay for everything.",
      "Internet access was $10.",
      "there is a charge if you want to print something.",
      "Didnt touch the minibar.",
      "However, they have automated machines to print out airline boarding passes (Free).",
      "Checkout can be done through these machines as well.",
      "In summary, the Grand Hyatt is a good hotel with a great location."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 2,
    "ratingRoom": 2,
    "author": "aran",
    "hotelId": "228610",
    "reviewId": "228610:27",
    "ratingLocation": -1,
    "ratingCleanliness": 3,
    "ratingService": 3,
    "ratingBusiness": -1,
    "ratingValue": 1,
    "segmentLabels": [
      {
        "LOCATION": "n",
        "SERVICE": "p"
      },
      {
        "CLEANLINESS": "p",
        "ROOMS": "n"
      },
      {
        "LOCATION": "x"
      },
      {
        "LOCATION": "n",
        "ROOMS": "n"
      },
      {
        "VALUE": "n"
      }
    ],
    "date": "Feb 1, 2006",
    "ratingCheckin": -1,
    "segments": [
      "just noisy The staff very helpful and friendly.",
      "The hotel was very very clean but the style of the rooms were old and tired (80), however the bed was comfortable and the bathrooms were nice and crean.",
      "It takes 20 to 30 minutes walking to la Placa Cataluna.",
      "Very noisy if you are one of the front rooms cos of the thin glass big windows and because the main street but also noisy doors and you can hear other people and staff.",
      "I found balmes hotel expensive."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": 5,
    "author": "LWoodzell",
    "hotelId": "579774",
    "reviewId": "579774:42",
    "ratingLocation": 5,
    "ratingCleanliness": 4,
    "ratingService": 5,
    "ratingBusiness": -1,
    "ratingValue": 4,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "OTHER": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "CHECKIN": "p"
      },
      {
        "CLEANLINESS": "p"
      },
      {
        "ROOMS": "n"
      },
      {
        "SERVICE": "ip"
      },
      {
        "FOOD": "x"
      },
      {
        "FOOD": "n"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "x"
      },
      {
        "OTHER": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "FOOD": "p"
      },
      {
        "FOOD": "p"
      },
      {
        "OTHER": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "p"
      }
    ],
    "date": "Jun 12, 2008",
    "ratingCheckin": 4,
    "segments": [
      "No problems with this place",
      "I went to the Iberostar Punta Cana May 29th-June 2nd.",
      "This was my first big trip out of the US and I am not much of a traveler I get sick easy.",
      "I am 26 years old from Charlottesville, VA and went with my girlfriend.",
      "When you get off the plane and you get your bags don't let the workers take your bags because they take you about 10 feet and then you are at the place where you find your bus to take you to the resort.",
      "I did pay someone to find my bus for me which was fine.",
      "The bus ride was fine and had AC but it takes about 45 mins to get to the resort.",
      "The check in was easy and it only took us about 20 min and we were in our room.",
      "The room was fine and our maid cleaned every day and left plenty of water and changed the sheets a couple of times during our stay.",
      "We had a problem with the safe and the back door would not locked when we first got in the room.",
      "We called the front desk and they had someone there with-in 10 min. and they fixed it.",
      "We then went down to the desk next to the buffet and front desk and booked our two meals this is a must if you want to get in do it right away.",
      "The food at the buffet was fine and they did change it up but you do get kind of tired of it by the end of the week.",
      "The pool was nice and we never had a problem finding a place to sit down.",
      "The beach was also nice and if you got down there by around 9:00 you could find a nice spot, any time after that you could get a seat but it would be in the back.",
      "They give you towel cards and you can get your towel at 8:00.",
      "We would just go down and get our towels leave them on a chair with a shirt of mine and then go eat breakfast.",
      "Be careful though a couple had some travel papers stolen from a book on the beach.",
      "We had one problem where a woman sat in our seats one day and she thought that her husband had left the towels for her and went to eat.",
      "After talking to her for about two minutes she got up and left and sat in another guys seat.",
      "So just leave a t-shirt or something to make sure nobody does this.",
      "The drinks are fine and the water is clean to drink at the buffet's and dinners just not out of a sink or shower.",
      "They do have good alcohol and they would give you plenty of it in your drink.",
      "The bar's are not that far from the beach and are right next to the pool along with a ice cream stand.",
      "There are some shops up the beach about a half a mile that you can bring the price down if you hagell them.",
      "Everything in the store you need to times the price listed by three to get it in US money.",
      "A candy bar was $1.50 and it is listed as 55 They had plenty of fun stuff to do bingo, volleyball, etc. and the workers are really nice and helpful.",
      "We did leave a dollar tip for every drink and two after every meal.",
      "They really think a lot if you give them a tip and are greatful.",
      "The last thing about it and it was not the best part of the trip was the ride back to the airport the driver was going too fast and it scared us a little but he got us there.",
      "All in all this is a great place to go and you will have fun."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 4,
    "ratingRoom": 4,
    "author": "Bradybunch77",
    "hotelId": "124176",
    "reviewId": "124176:5",
    "ratingLocation": 4,
    "ratingCleanliness": 5,
    "ratingService": 5,
    "ratingBusiness": -1,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p",
        "VALUE": "p"
      },
      {
        "CLEANLINESS": "p",
        "ROOMS": "p"
      },
      {
        "BUILDING": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "LOCATION": "p"
      },
      {
        "LOCATION": "p"
      }
    ],
    "date": "Jun 9, 2008",
    "ratingCheckin": 5,
    "segments": [
      "The best of both worlds!",
      "I have now returned to this hotel twice for a week each time and LOVED it! For the price, you get a great deal of value.",
      "The rooms are pristine, compact and offer everything that you need for a comfy stay.",
      "The courtyards and pool were great!",
      "the Staff are very friendly, talkative and open to any and all questions, As someone who had to park a large van, their secure exterior lot was so amazing.",
      "If you are looking to be able to walk out of your hotel door and be in the heart of New Orleans, you are going to pay twice as much than the Maison St. Charles.",
      "If you want easy access to local transportation and the Garden District, great local eateries (Slice is a slice of heaven!) and want to save your travel money to eat and shop-- stay here!"
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 1,
    "ratingRoom": -1,
    "author": "love2travelaz",
    "hotelId": "279809",
    "reviewId": "279809:127",
    "ratingLocation": -1,
    "ratingCleanliness": -1,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": -1,
    "segmentLabels": [
      {
        "OTHER": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "FOOD": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "BUILDING": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "OTHER": "n"
      }
    ],
    "date": "Jul 2, 2007",
    "ratingCheckin": -1,
    "segments": [
      "STOP! Do not pass the reserve button!!",
      "We arrived on July 21, 2007 and stayed approximately 3 hours...just long enough to get booked and moved to another resort.",
      "None of the restaurants have air conditioning so you sweat your way through eating!",
      "Not a very pleasant experience.",
      "Our rooms were not cooled (both of them) and the sliding glass doors would not close all of the way which would allow the local mosquitos to eat us alive!",
      "The grounds were o.k., but the atmosphere was that of locals staying at the LTI.",
      "Our first and probably last trip to Punta Cana.",
      "We are worldtravelers and there is a reason why there are inexpensive vacations to this island....good luck if you push the reserve button!!!"
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 1,
    "ratingRoom": 1,
    "author": "traveltoomuchToronto",
    "hotelId": "77700",
    "reviewId": "77700:54",
    "ratingLocation": 3,
    "ratingCleanliness": 1,
    "ratingService": 2,
    "ratingBusiness": 3,
    "ratingValue": 1,
    "segmentLabels": [
      {
        "OTHER": "n"
      },
      {
        "CLEANLINESS": "n",
        "FOOD": "n",
        "SERVICE": "n",
        "VALUE": "n",
        "ROOMS": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "CLEANLINESS": "in"
      },
      {
        "CLEANLINESS": "in"
      },
      {
        "NOTRELATED": "x"
      }
    ],
    "date": "Feb 4, 2007",
    "ratingCheckin": 1,
    "segments": [
      "Once again, beat up and tired",
      "Hallways and room are best summed up as having the appearance of 30 years of Spring Break cavorting without a cleaning, stains on all walls, carpets, and furniture, typical dark W hallways and rooms, poor towels, overpriced water ($8 per bottle), staff with attitude at the front desk, car valets were very good, flies join you for your beakfast without invite, food stains all over the restaurant menus each time the last three stays, $3.25 surcharge for using the ATM and limited to $100 (what will $100 buy you at a W hotel?),",
      "well below expectation for a Starwood Hotel, do yourself a favour, bring Lysol or stay somewhere else.",
      "Instead of taking photos of guests in the elevators, they should video their cleaning staff to determine what they have been doing.",
      "The US disease control unit should be called into this overpriced dormitory.",
      "The Bliss Spa was excellent though."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 2,
    "ratingRoom": 2,
    "author": "reniqua",
    "hotelId": "630409",
    "reviewId": "630409:141",
    "ratingLocation": 5,
    "ratingCleanliness": 2,
    "ratingService": 4,
    "ratingBusiness": 4,
    "ratingValue": 2,
    "segmentLabels": [
      {
        "OTHER": "n"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "OTHER": "x"
      },
      {
        "OTHER": "n"
      },
      {
        "CLEANLINESS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "ROOMS": "p"
      },
      {
        "ROOMS": "n"
      },
      {
        "ROOMS": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "SERVICE": "p"
      },
      {
        "OTHER": "n",
        "LOCATION": "p"
      },
      {
        "OTHER": "n"
      }
    ],
    "date": "Apr 8, 2007",
    "ratingCheckin": 1,
    "segments": [
      "London cold and snooty",
      "I just returned from NYC, one of my favorite places.",
      "I booked a stay at the London because I was curious about the changes they made from the former Rhiga Royale.",
      "I was totally unimpressed.",
      "The bedroom was left dirty, we found discarded garbage next to our bed.",
      "We also found there was nowhere to store your luggage.",
      "What happened to closet space?",
      "We had a cold, boring room.",
      "No art on the walls, nothing.",
      "To be fair, I liked the bathroom.",
      "However, there could be better planning on where do you hang your towel's when you are in the shower?",
      "Our towels were behind the toilet, not within reach of the walk in shower.",
      "The front desk staff are inexperienced and not friendly.",
      "The bellman, concierge were all extremely helpful, and courteous.",
      "I love the location, but will think twice about staying at the London again.",
      "Its too bad, because I have very fond memories of the Rhiga, and I was hoping to have fond memories of the London."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 3,
    "ratingRoom": 3,
    "author": "fussyfamily",
    "hotelId": "190635",
    "reviewId": "190635:77",
    "ratingLocation": 4,
    "ratingCleanliness": 3,
    "ratingService": 3,
    "ratingBusiness": 3,
    "ratingValue": 2,
    "segmentLabels": [
      {
        "OTHER": "n"
      },
      {
        "OTHER": "n"
      },
      {
        "OTHER": "x"
      },
      {
        "OTHER": "x"
      },
      {
        "OTHER": "x"
      },
      {
        "OTHER": "x"
      },
      {
        "SERVICE": "n"
      },
      {
        "SERVICE": "n"
      },
      {
        "BUSINESS": "x"
      },
      {
        "BUSINESS": "x"
      },
      {
        "SERVICE": "n",
        "BUSINESS": "x"
      },
      {
        "SERVICE": "n"
      },
      {
        "BUSINESS": "n"
      },
      {
        "OTHER": "ip"
      },
      {
        "BUILDING": "p",
        "FOOD": "p",
        "LOCATION": "p",
        "SERVICE": "p"
      },
      {
        "OTHER": "n",
        "NOTRELATED": "x"
      }
    ],
    "date": "Oct 15, 2007",
    "ratingCheckin": 3,
    "segments": [
      "Poor Arts has had its day",
      "Cracks are clearly appearing in the Arts and it is in need of an overhaul.I have stayed here a few times.",
      "Last time in January with my wife and this time on business.",
      "In Jan we went for it and booked an expensive Club Room for a romantic weekend.",
      "This gives you access to the Club floor with breakfast and drinks thrown in.",
      "Or should do.",
      "One morning they effectively kicked my wife out of breakfast because they thought she was not from the club rooms.",
      "Despite apologies and rose petals on our bed we decided not to go back.",
      "However, I have just been again for a business conference.",
      "And that is what the Arts is all about - business conferences.",
      "They don't need to be good on service as most people are not paying the bills and won't even appreciate the service anyway.",
      "Everyone gets drunk in the bar until 3am and the hotel makes money.",
      "Even for business conferences it is a rip off- the amount they charge for basic business items is criminal.",
      "In fairness some things don't change.",
      "The design of the hotel, the rooms are holding up amazingly well, the food is very good, the conciege very good and the location is nice.",
      "( beware of the many pickpockets in the area)But the arts is neither trendy nor high rolling and there are many better hotels in Barcelona nowadays."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": 5,
    "author": "Vanessa971",
    "hotelId": "579774",
    "reviewId": "579774:152",
    "ratingLocation": 5,
    "ratingCleanliness": 5,
    "ratingService": 4,
    "ratingBusiness": 5,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "CLEANLINESS": "p",
        "FOOD": "p",
        "SERVICE": "p"
      },
      {
        "SERVICE": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "FOOD": "p"
      },
      {
        "CLEANLINESS": "p",
        "ROOMS": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      }
    ],
    "date": "May 4, 2007",
    "ratingCheckin": 5,
    "segments": [
      "Had a Fabulous",
      "Holiday at Iberostar Punta Cana This hotel had everything spot on.",
      "There was everything there that you could want.",
      "Everything was taken care of and you didn't need to think of anything for yourself it was all in hand from the staff.",
      "Service is fantastic in the buffet restaurant, your table is cleared immediately and your glass is never empty.",
      "Some of the staff do not speak good english so it is worth learning some basic spanish.",
      "If you are single girls travelling alone, you will get a lot of attention from the locals both at the hotel and outside.",
      "They will all want to date you!",
      "Every kind of food you could wish for.",
      "Rooms are really clean and spacious.",
      "Good place for couples, families.",
      "Probably only singles If you are a girl !!",
      "The majority of the people here are families and couples, so if you are a single female, be prepared to fight the men off!!",
      "We met some really nice people when we were there so that helped make our holiday."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": 4,
    "author": "londoneagle",
    "hotelId": "222959",
    "reviewId": "222959:8",
    "ratingLocation": 5,
    "ratingCleanliness": 4,
    "ratingService": 4,
    "ratingBusiness": 4,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "OTHER": "x",
        "LOCATION": "p"
      },
      {
        "OTHER": "x"
      },
      {
        "LOCATION": "p",
        "VALUE": "x"
      },
      {
        "LOCATION": "x"
      },
      {
        "LOCATION": "p"
      },
      {
        "LOCATION": "p"
      },
      {
        "LOCATION": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "SERVICE": "p"
      },
      {
        "NOTRELATED": "x"
      }
    ],
    "date": "Aug 27, 2008",
    "ratingCheckin": 5,
    "segments": [
      "Perfect Location We have just returned from a 5 night stay at the Ritz Carlton Batt",
      "Park having visited New York 4 times before.",
      "We chose this hotel because of a special deal from British Airways and the good location.",
      "The hotel is based at the very end of Manhatton often referred to as Lower Manhatton or Downtown.",
      "It is right next to all the ferries and many hotel rooms have a magnificant view of the Statue of Liberty.",
      "It is also next to the city and all the skyscrapers, so the other hotel rooms also have an incredible view.",
      "You can easily walk to the WTC site, Wall street, South Seaport and there is an underground stop very closeby which gives you access to the rest of NY.The area is very safe and it was great visiting 5th Avenue and Times square via underground, but it was also great getting away from the madness to the tranquility of the Ritz Carlton.",
      "You get a real chance to experience the real New York as most of the restaurants and bars are full of locals - not tourists.",
      "Went to Bobby Vans, River Cafe, Bateaux Cruise, 2-West and One by Land Two by Sea.",
      "All fantastic, probably ranked in the order I listed them.",
      "Not cheap in this area except for clothes.",
      "Service in hotel very good and cocktail bar on 14th floor has outdoor spectacular views of Statue Liberty.",
      "We thought we were mixing with Sex in the City types and we couldnt resist joining in by ordering cosmopolitans as in the film."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 2,
    "ratingRoom": -1,
    "author": "luby",
    "hotelId": "305813",
    "reviewId": "305813:349",
    "ratingLocation": 3,
    "ratingCleanliness": 4,
    "ratingService": -1,
    "ratingBusiness": 3,
    "ratingValue": 3,
    "segmentLabels": [
      {
        "OTHER": "n"
      },
      {
        "SERVICE": "n",
        "VALUE": "n"
      },
      {
        "ROOMS": "n",
        "SERVICE": "n"
      },
      {
        "OTHER": "n"
      }
    ],
    "date": "Apr 18, 2007",
    "ratingCheckin": 2,
    "segments": [
      "Don't stay here",
      "Stayed at the Langham Place a 5 start hotel very expencive but very poor service.",
      "One has one type of beds and they are rock hard, do not complain as you will only be insulted.",
      "more Like a faulty towers hotel then a 5 star."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": 4,
    "author": "goldenbear01",
    "hotelId": "87097",
    "reviewId": "87097:25",
    "ratingLocation": 5,
    "ratingCleanliness": 5,
    "ratingService": 5,
    "ratingBusiness": 2,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "OTHER": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "CHECKIN": "p"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "SERVICE": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "OTHER": "p"
      }
    ],
    "date": "May 27, 2008",
    "ratingCheckin": 5,
    "segments": [
      "Royal Grove Rocks (or at least jams on",
      "Tues nights) I visited the Royal Grove on 05/20-05/23; aside from the weather, which was generally overcast with some light drizzle, I had a great time during my stay in no small part due to the Royal Grove.",
      "I arrived at the hotel and checked-in at around 3pm; my cousin, with whom I was sharing the room, arrived at around midnight (after his flight was delayed) and had no problems checking into the room after I informed Christy that he'd be arriving later.",
      "The really cool part about the stay (aside from the great price and the proximity to the beach) is the jam session that took place on Tuesday night.",
      "The owners (the Fongs) invited some of their friends over to jam to some Hawaiian tunes on some ukuleles, an acoustic guitar, an electric guitar, an electric bass guitar, and a set of drums.",
      "The music was pretty sweet as was the impromptu hula session given by the (daughter-in-law?).",
      "After the jam session, I had the chance to meet the Fongs, who as it turns out, have owned the Royal Grove for about 40 years now.",
      "Although they still own the hotel, the Fongs leave the day-to-day management up to one of their sons, Tim, whom I also had the chance to meet.",
      "I'm not sure how Tim does it, but the staff he works with was generally really friendly and helpful.",
      "Speaking of which, Christy, one of the ladies behind the counter was a total rockstar of friendliness and helpfulness.",
      "She wasn't alone in this; I was able to get directions to a good (and inexpensive) salon for a haircut, directions to a place for good eats nearby, etc. throughout my stay.",
      "All in all, I had a blast during my stay at the Royal Grove and look forward to another stay there."
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 1,
    "ratingRoom": -1,
    "author": "A TripAdvisor Member",
    "hotelId": "150841",
    "reviewId": "150841:1095",
    "ratingLocation": -1,
    "ratingCleanliness": -1,
    "ratingService": -1,
    "ratingBusiness": -1,
    "ratingValue": -1,
    "segmentLabels": [
      {
        "OTHER": "n"
      },
      {
        "FOOD": "n",
        "OTHER": "n"
      },
      {
        "CLEANLINESS": "n",
        "ROOMS": "n"
      },
      {
        "OTHER": "n"
      }
    ],
    "date": "Mar 11, 2003",
    "ratingCheckin": -1,
    "segments": [
      "I Definitley Won't Go Back!!",
      "The beach was beautiful - the grounds were nice but other than that HUGE disappointment! The drinks were the worst I have ever had anywhere! The food was on the weak side as well, they couldn't of used any less quality anywhere.",
      "The rooms were dirty, terrible plumbing.",
      "In the future I'll pay for service and good food/drinks .... when it sounds too cheap, IT IS!"
    ]
  },
  {
    "annotatorId": 2,
    "ratingOverall": 5,
    "ratingRoom": 5,
    "author": "MikeLisaAnna",
    "hotelId": "305304",
    "reviewId": "305304:6",
    "ratingLocation": 5,
    "ratingCleanliness": 5,
    "ratingService": 5,
    "ratingBusiness": 5,
    "ratingValue": 5,
    "segmentLabels": [
      {
        "OTHER": "p",
        "LOCATION": "p"
      },
      {
        "LOCATION": "p"
      },
      {
        "LOCATION": "ip"
      },
      {
        "ROOMS": "p"
      },
      {
        "CLEANLINESS": "p",
        "ROOMS": "p"
      },
      {
        "OTHER": "p"
      },
      {
        "OTHER": "x"
      },
      {
        "OTHER": "x"
      },
      {
        "BUILDING": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "SERVICE": "p"
      },
      {
        "BUSINESS": "p"
      },
      {
        "FOOD": "p",
        "VALUE": "n"
      },
      {
        "NOTRELATED": "x"
      },
      {
        "FOOD": "p"
      },
      {
        "OTHER": "p"
      }
    ],
    "date": "Oct 31, 2008",
    "ratingCheckin": 5,
    "segments": [
      "Great location and a really great indoor pool The Grand",
      "Hyatt is the most conveniently located of the 5-star hotels in Beijing.",
      "It is a 10-minute taxi ride from Tiananmen Square, a 10-minute walk from Wangfujing (Beijing's main pedestrian shopping street), and right next door to Oriental Plaza, Beijing's largest indoor shopping mall.",
      "The hotels rooms are nice, but not exceptional.",
      "They were clean and modern, and had good large bathrooms.",
      "What makes the hotel special are it common areas, especially its large indoor swimming pool, which is one of the best in the world (we are not kidding!).",
      "The pool area is decorated like a tropical paradise, with simulated twinkling stars overhead.",
      "Adjacent to the pool is a spa and health club complex.",
      "The hotel's lobby is full of marble and has a pleasant seating area where you can enjoy a drink or snack.",
      "The front desk is friendly and efficient, and there is a helpful concierge desk.",
      "Enough staff members spoke English that we had no language problems.",
      "In addition, the hotel has a large full-service business center, which was user-friendly.",
      "There are a number of good restaurants in the hotel, although they are not cheap.",
      "If you want something more casual, there is a wide range of restaurants in the Oriental Plaza mall next door.",
      "The breakfast buffet at the Hyatt was excellent, with a good selection of hot and cold Asian and Western foods.",
      "Overall, we very much enjoyed our stay at the Grand Hyatt and definitely recommend it."
    ]
  }
]